###################################################################

# Created by write_sdc on Tue May  6 09:31:14 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports clk]
set_input_delay -clock clk  0.01  [get_ports rst]
set_input_delay -clock clk  0.01  [get_ports {ssel[2]}]
set_input_delay -clock clk  0.01  [get_ports {ssel[1]}]
set_input_delay -clock clk  0.01  [get_ports {ssel[0]}]
set_input_delay -clock clk  0.01  [get_ports pcm_clk_i]
set_input_delay -clock clk  0.01  [get_ports pcm_sync_i]
set_input_delay -clock clk  0.01  [get_ports pcm_din_i]
set_input_delay -clock clk  0.01  [get_ports {din_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[0]}]
set_input_delay -clock clk  0.01  [get_ports re_i]
set_input_delay -clock clk  0.01  [get_ports {we_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {we_i[0]}]
set_output_delay -clock clk  0.01  [get_ports pcm_dout_o]
set_output_delay -clock clk  0.01  [get_ports {dout_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[0]}]
set_load 0.477355  [get_nets n101]
set_resistance 9.78362e-06  [get_nets n101]
set_load 1.11865  [get_nets n100]
set_resistance 2.50685e-05  [get_nets n100]
set_load 0.23143  [get_nets n126]
set_resistance 5.86886e-06  [get_nets n126]
set_load 0.661958  [get_nets n67]
set_resistance 1.63215e-05  [get_nets n67]
set_load 0.614276  [get_nets pcm_sync_r2]
set_resistance 1.57875e-05  [get_nets pcm_sync_r2]
set_load 1.77385  [get_nets pclk_t]
set_resistance 3.5195e-05  [get_nets pclk_t]
set_load 0.277273  [get_nets n23]
set_resistance 6.90646e-06  [get_nets n23]
set_load 0.51994  [get_nets n124]
set_resistance 1.29497e-05  [get_nets n124]
set_load 0.556058  [get_nets n22]
set_resistance 1.35403e-05  [get_nets n22]
set_load 0.351049  [get_nets n116]
set_resistance 8.78962e-06  [get_nets n116]
set_load 0.429061  [get_nets n32]
set_resistance 7.59582e-06  [get_nets n32]
set_load 0.631386  [get_nets n125]
set_resistance 1.47409e-05  [get_nets n125]
set_load 0.735513  [get_nets n26]
set_resistance 1.72202e-05  [get_nets n26]
set_load 0.506798  [get_nets n33]
set_resistance 9.94865e-06  [get_nets n33]
set_load 0.50299  [get_nets n119]
set_resistance 1.16056e-05  [get_nets n119]
set_load 0.459001  [get_nets n27]
set_resistance 1.06913e-05  [get_nets n27]
set_load 0.466277  [get_nets n117]
set_resistance 1.08418e-05  [get_nets n117]
set_load 0.396856  [get_nets {tx_hold_reg[1]}]
set_resistance 9.85364e-06  [get_nets {tx_hold_reg[1]}]
set_load 0.467715  [get_nets n115]
set_resistance 1.10389e-05  [get_nets n115]
set_load 5.07481  [get_nets n17]
set_resistance 0.000105734  [get_nets n17]
set_load 0.768013  [get_nets {tx_hold_reg[2]}]
set_resistance 1.66041e-05  [get_nets {tx_hold_reg[2]}]
set_load 0.561699  [get_nets n113]
set_resistance 1.12503e-05  [get_nets n113]
set_load 1.12335  [get_nets {tx_hold_reg[3]}]
set_resistance 2.38553e-05  [get_nets {tx_hold_reg[3]}]
set_load 0.517736  [get_nets n112]
set_resistance 1.11608e-05  [get_nets n112]
set_load 0.317468  [get_nets {tx_hold_reg[4]}]
set_resistance 8.48533e-06  [get_nets {tx_hold_reg[4]}]
set_load 0.599957  [get_nets n111]
set_resistance 1.33979e-05  [get_nets n111]
set_load 0.824895  [get_nets {tx_hold_reg[5]}]
set_resistance 1.73259e-05  [get_nets {tx_hold_reg[5]}]
set_load 0.307296  [get_nets n110]
set_resistance 7.41413e-06  [get_nets n110]
set_load 0.472523  [get_nets {tx_hold_reg[6]}]
set_resistance 1.06415e-05  [get_nets {tx_hold_reg[6]}]
set_load 0.595522  [get_nets n109]
set_resistance 1.25841e-05  [get_nets n109]
set_load 0.560472  [get_nets {tx_hold_reg[7]}]
set_resistance 1.22035e-05  [get_nets {tx_hold_reg[7]}]
set_load 0.746506  [get_nets n108]
set_resistance 1.60315e-05  [get_nets n108]
set_load 1.85426  [get_nets {tx_hold_reg[8]}]
set_resistance 3.90618e-05  [get_nets {tx_hold_reg[8]}]
set_load 0.542051  [get_nets n107]
set_resistance 1.24996e-05  [get_nets n107]
set_load 0.729356  [get_nets {tx_hold_reg[9]}]
set_resistance 1.71107e-05  [get_nets {tx_hold_reg[9]}]
set_load 0.753447  [get_nets n106]
set_resistance 1.69451e-05  [get_nets n106]
set_load 0.484538  [get_nets {tx_hold_reg[10]}]
set_resistance 1.19842e-05  [get_nets {tx_hold_reg[10]}]
set_load 0.628515  [get_nets n105]
set_resistance 1.33944e-05  [get_nets n105]
set_load 0.959375  [get_nets {tx_hold_reg[11]}]
set_resistance 2.16978e-05  [get_nets {tx_hold_reg[11]}]
set_load 0.442139  [get_nets n104]
set_resistance 1.06971e-05  [get_nets n104]
set_load 1.14555  [get_nets {tx_hold_reg[12]}]
set_resistance 2.02342e-05  [get_nets {tx_hold_reg[12]}]
set_load 0.569522  [get_nets n103]
set_resistance 1.13709e-05  [get_nets n103]
set_load 1.10096  [get_nets {tx_hold_reg[13]}]
set_resistance 2.47253e-05  [get_nets {tx_hold_reg[13]}]
set_load 0.482006  [get_nets n102]
set_resistance 1.10254e-05  [get_nets n102]
set_load 0.4835  [get_nets {tx_hold_reg[14]}]
set_resistance 1.16901e-05  [get_nets {tx_hold_reg[14]}]
set_load 0.847455  [get_nets {tx_cnt[3]}]
set_resistance 1.77898e-05  [get_nets {tx_cnt[3]}]
set_load 0.374738  [get_nets n29]
set_resistance 7.28443e-06  [get_nets n29]
set_load 0.285106  [get_nets n118]
set_resistance 6.96633e-06  [get_nets n118]
set_load 6.29157  [get_nets n3]
set_resistance 0.000125404  [get_nets n3]
set_load 0.225854  [get_nets n65]
set_resistance 5.25463e-06  [get_nets n65]
set_load 0.43816  [get_nets n64]
set_resistance 1.01238e-05  [get_nets n64]
set_load 0.404028  [get_nets n63]
set_resistance 8.5716e-06  [get_nets n63]
set_load 0.319984  [get_nets n62]
set_resistance 7.32284e-06  [get_nets n62]
set_load 0.271787  [get_nets n61]
set_resistance 7.37583e-06  [get_nets n61]
set_load 0.323021  [get_nets n60]
set_resistance 7.70534e-06  [get_nets n60]
set_load 0.547082  [get_nets n59]
set_resistance 1.36112e-05  [get_nets n59]
set_load 0.481647  [get_nets n58]
set_resistance 1.11996e-05  [get_nets n58]
set_load 0.326615  [get_nets n40]
set_resistance 8.78962e-06  [get_nets n40]
set_load 0.331276  [get_nets n35]
set_resistance 6.9817e-06  [get_nets n35]
set_load 0.622259  [get_nets n123]
set_resistance 1.20148e-05  [get_nets n123]
set_load 0.550853  [get_nets n120]
set_resistance 1.25066e-05  [get_nets n120]
set_load 0.192275  [get_nets n122]
set_resistance 4.66297e-06  [get_nets n122]
set_load 1.02803  [get_nets {tx_hold_reg[0]}]
set_resistance 2.23045e-05  [get_nets {tx_hold_reg[0]}]
set_load 0.547495  [get_nets n114]
set_resistance 1.20535e-05  [get_nets n114]
set_load 0.403475  [get_nets n83]
set_resistance 9.60181e-06  [get_nets n83]
set_load 0.312649  [get_nets n82]
set_resistance 8.44588e-06  [get_nets n82]
set_load 0.279373  [get_nets n81]
set_resistance 6.14399e-06  [get_nets n81]
set_load 0.538433  [get_nets n80]
set_resistance 1.11719e-05  [get_nets n80]
set_load 0.492344  [get_nets n79]
set_resistance 8.96117e-06  [get_nets n79]
set_load 0.456295  [get_nets n78]
set_resistance 1.10318e-05  [get_nets n78]
set_load 0.461303  [get_nets n77]
set_resistance 1.09683e-05  [get_nets n77]
set_load 0.378989  [get_nets n76]
set_resistance 9.33137e-06  [get_nets n76]
set_load 0.461859  [get_nets n75]
set_resistance 9.75553e-06  [get_nets n75]
set_load 0.605148  [get_nets n74]
set_resistance 1.31279e-05  [get_nets n74]
set_load 0.411723  [get_nets n73]
set_resistance 8.17138e-06  [get_nets n73]
set_load 0.543033  [get_nets n72]
set_resistance 1.1822e-05  [get_nets n72]
set_load 0.289141  [get_nets n71]
set_resistance 7.70757e-06  [get_nets n71]
set_load 0.235526  [get_nets n70]
set_resistance 6.15749e-06  [get_nets n70]
set_load 0.463431  [get_nets n69]
set_resistance 1.14992e-05  [get_nets n69]
set_load 0.579076  [get_nets n68]
set_resistance 1.34529e-05  [get_nets n68]
set_load 0.766166  [get_nets {tx_hold_byte_l[5]}]
set_resistance 1.58902e-05  [get_nets {tx_hold_byte_l[5]}]
set_load 0.538878  [get_nets n45]
set_resistance 1.04812e-05  [get_nets n45]
set_load 2.35162  [get_nets {tx_hold_byte_l[4]}]
set_resistance 5.12447e-05  [get_nets {tx_hold_byte_l[4]}]
set_load 0.21203  [get_nets n44]
set_resistance 5.89013e-06  [get_nets n44]
set_load 1.90605  [get_nets {tx_hold_byte_l[3]}]
set_resistance 3.94266e-05  [get_nets {tx_hold_byte_l[3]}]
set_load 0.533138  [get_nets n43]
set_resistance 1.25853e-05  [get_nets n43]
set_load 0.978082  [get_nets {tx_hold_byte_l[2]}]
set_resistance 1.91996e-05  [get_nets {tx_hold_byte_l[2]}]
set_load 0.523254  [get_nets n42]
set_resistance 9.81864e-06  [get_nets n42]
set_load 1.33874  [get_nets {tx_hold_byte_l[1]}]
set_resistance 2.88289e-05  [get_nets {tx_hold_byte_l[1]}]
set_load 0.590442  [get_nets n41]
set_resistance 1.28554e-05  [get_nets n41]
set_load 1.19923  [get_nets {tx_hold_byte_l[0]}]
set_resistance 2.31555e-05  [get_nets {tx_hold_byte_l[0]}]
set_load 1.44968  [get_nets {rx_reg[15]}]
set_resistance 3.23286e-05  [get_nets {rx_reg[15]}]
set_load 2.46385  [get_nets {rx_reg[7]}]
set_resistance 5.25589e-05  [get_nets {rx_reg[7]}]
set_load 0.514196  [get_nets {rx_reg[14]}]
set_resistance 1.22637e-05  [get_nets {rx_reg[14]}]
set_load 0.508691  [get_nets {rx_reg[6]}]
set_resistance 1.20027e-05  [get_nets {rx_reg[6]}]
set_load 1.4559  [get_nets {rx_reg[13]}]
set_resistance 3.28635e-05  [get_nets {rx_reg[13]}]
set_load 0.678408  [get_nets {rx_reg[5]}]
set_resistance 1.57955e-05  [get_nets {rx_reg[5]}]
set_load 1.45261  [get_nets {rx_reg[12]}]
set_resistance 2.92988e-05  [get_nets {rx_reg[12]}]
set_load 0.946795  [get_nets {rx_reg[4]}]
set_resistance 2.17237e-05  [get_nets {rx_reg[4]}]
set_load 2.65279  [get_nets {rx_reg[11]}]
set_resistance 5.0269e-05  [get_nets {rx_reg[11]}]
set_load 0.824786  [get_nets {rx_reg[3]}]
set_resistance 1.6911e-05  [get_nets {rx_reg[3]}]
set_load 1.29482  [get_nets {rx_reg[10]}]
set_resistance 2.68566e-05  [get_nets {rx_reg[10]}]
set_load 0.615758  [get_nets {rx_reg[2]}]
set_resistance 1.4183e-05  [get_nets {rx_reg[2]}]
set_load 1.28102  [get_nets {rx_reg[9]}]
set_resistance 2.44263e-05  [get_nets {rx_reg[9]}]
set_load 0.552937  [get_nets {rx_reg[1]}]
set_resistance 1.41882e-05  [get_nets {rx_reg[1]}]
set_load 0.774139  [get_nets {rx_reg[8]}]
set_resistance 1.88249e-05  [get_nets {rx_reg[8]}]
set_load 1.16823  [get_nets {rx_reg[0]}]
set_resistance 2.62325e-05  [get_nets {rx_reg[0]}]
set_load 0.826075  [get_nets tx_go_r1]
set_resistance 1.76464e-05  [get_nets tx_go_r1]
set_load 0.943649  [get_nets tx_go]
set_resistance 2.21933e-05  [get_nets tx_go]
set_load 0.458259  [get_nets n30]
set_resistance 8.50578e-06  [get_nets n30]
set_load 1.50621  [get_nets {rx_hold_reg[12]}]
set_resistance 3.17162e-05  [get_nets {rx_hold_reg[12]}]
set_load 0.303598  [get_nets n86]
set_resistance 7.44944e-06  [get_nets n86]
set_load 2.02916  [get_nets {rx_hold_reg[13]}]
set_resistance 4.28682e-05  [get_nets {rx_hold_reg[13]}]
set_load 0.518655  [get_nets n85]
set_resistance 1.16661e-05  [get_nets n85]
set_load 3.01013  [get_nets {rx_hold_reg[14]}]
set_resistance 6.64817e-05  [get_nets {rx_hold_reg[14]}]
set_load 0.484045  [get_nets n84]
set_resistance 1.13621e-05  [get_nets n84]
set_load 0.531886  [get_nets {rx_hold_reg[15]}]
set_resistance 1.08772e-05  [get_nets {rx_hold_reg[15]}]
set_load 0.461689  [get_nets n56]
set_resistance 1.09683e-05  [get_nets n56]
set_load 1.89803  [get_nets {tx_hold_byte_h[7]}]
set_resistance 4.33555e-05  [get_nets {tx_hold_byte_h[7]}]
set_load 0.315786  [get_nets n55]
set_resistance 6.73456e-06  [get_nets n55]
set_load 0.706088  [get_nets {tx_hold_byte_h[6]}]
set_resistance 1.6097e-05  [get_nets {tx_hold_byte_h[6]}]
set_load 0.416806  [get_nets n54]
set_resistance 9.42373e-06  [get_nets n54]
set_load 0.678176  [get_nets {tx_hold_byte_h[5]}]
set_resistance 1.6067e-05  [get_nets {tx_hold_byte_h[5]}]
set_load 0.340561  [get_nets n53]
set_resistance 9.06045e-06  [get_nets n53]
set_load 1.02785  [get_nets {tx_hold_byte_h[4]}]
set_resistance 2.25375e-05  [get_nets {tx_hold_byte_h[4]}]
set_load 0.529875  [get_nets n52]
set_resistance 1.1551e-05  [get_nets n52]
set_load 2.35434  [get_nets {tx_hold_byte_h[3]}]
set_resistance 4.54434e-05  [get_nets {tx_hold_byte_h[3]}]
set_load 0.513105  [get_nets n51]
set_resistance 1.07227e-05  [get_nets n51]
set_load 1.39226  [get_nets {tx_hold_byte_h[2]}]
set_resistance 2.86086e-05  [get_nets {tx_hold_byte_h[2]}]
set_load 0.342691  [get_nets n50]
set_resistance 6.82785e-06  [get_nets n50]
set_load 1.152  [get_nets {tx_hold_byte_h[1]}]
set_resistance 2.41491e-05  [get_nets {tx_hold_byte_h[1]}]
set_load 0.339673  [get_nets n49]
set_resistance 9.06045e-06  [get_nets n49]
set_load 0.70507  [get_nets {tx_hold_byte_h[0]}]
set_resistance 1.68673e-05  [get_nets {tx_hold_byte_h[0]}]
set_load 0.288689  [get_nets n48]
set_resistance 7.25639e-06  [get_nets n48]
set_load 1.57369  [get_nets {tx_hold_byte_l[7]}]
set_resistance 3.37736e-05  [get_nets {tx_hold_byte_l[7]}]
set_load 0.442242  [get_nets n47]
set_resistance 1.06367e-05  [get_nets n47]
set_load 1.55562  [get_nets {tx_hold_byte_l[6]}]
set_resistance 3.17505e-05  [get_nets {tx_hold_byte_l[6]}]
set_load 0.44583  [get_nets n46]
set_resistance 1.09683e-05  [get_nets n46]
set_load 0.346177  [get_nets n66]
set_resistance 7.67749e-06  [get_nets n66]
set_load 0.761867  [get_nets n38]
set_resistance 1.70937e-05  [get_nets n38]
set_load 0.585227  [get_nets n39]
set_resistance 1.21017e-05  [get_nets n39]
set_load 0.980289  [get_nets rxd_t]
set_resistance 1.96614e-05  [get_nets rxd_t]
set_load 1.14146  [get_nets {tx_cnt[1]}]
set_resistance 2.28631e-05  [get_nets {tx_cnt[1]}]
set_load 0.624327  [get_nets n31]
set_resistance 1.46319e-05  [get_nets n31]
set_load 1.20728  [get_nets {tx_cnt[0]}]
set_resistance 2.75946e-05  [get_nets {tx_cnt[0]}]
set_load 0.359357  [get_nets {tx_cnt[2]}]
set_resistance 9.38862e-06  [get_nets {tx_cnt[2]}]
set_load 0.95151  [get_nets pclk_s]
set_resistance 2.30718e-05  [get_nets pclk_s]
set_load 0.336161  [get_nets n121]
set_resistance 9.06648e-06  [get_nets n121]
set_load 0.304124  [get_nets n127]
set_resistance 5.65505e-06  [get_nets n127]
set_load 0.441742  [get_nets n99]
set_resistance 1.03516e-05  [get_nets n99]
set_load 1.63664  [get_nets {rx_hold_reg[0]}]
set_resistance 3.08325e-05  [get_nets {rx_hold_reg[0]}]
set_load 1.05473  [get_nets rxd]
set_resistance 2.19804e-05  [get_nets rxd]
set_load 0.428621  [get_nets n98]
set_resistance 1.08929e-05  [get_nets n98]
set_load 1.30797  [get_nets {rx_hold_reg[1]}]
set_resistance 2.82746e-05  [get_nets {rx_hold_reg[1]}]
set_load 0.365441  [get_nets n97]
set_resistance 7.10613e-06  [get_nets n97]
set_load 1.08783  [get_nets {rx_hold_reg[2]}]
set_resistance 2.34671e-05  [get_nets {rx_hold_reg[2]}]
set_load 0.444195  [get_nets n96]
set_resistance 9.58628e-06  [get_nets n96]
set_load 1.13147  [get_nets {rx_hold_reg[3]}]
set_resistance 2.53043e-05  [get_nets {rx_hold_reg[3]}]
set_load 0.281776  [get_nets n95]
set_resistance 7.44944e-06  [get_nets n95]
set_load 1.18542  [get_nets {rx_hold_reg[4]}]
set_resistance 2.73824e-05  [get_nets {rx_hold_reg[4]}]
set_load 0.62347  [get_nets n94]
set_resistance 1.20313e-05  [get_nets n94]
set_load 1.0955  [get_nets {rx_hold_reg[5]}]
set_resistance 2.2408e-05  [get_nets {rx_hold_reg[5]}]
set_load 0.479666  [get_nets n93]
set_resistance 1.12049e-05  [get_nets n93]
set_load 1.46189  [get_nets {rx_hold_reg[6]}]
set_resistance 3.37441e-05  [get_nets {rx_hold_reg[6]}]
set_load 0.385275  [get_nets n92]
set_resistance 8.78962e-06  [get_nets n92]
set_load 1.51712  [get_nets {rx_hold_reg[7]}]
set_resistance 2.91619e-05  [get_nets {rx_hold_reg[7]}]
set_load 0.553458  [get_nets n91]
set_resistance 1.25962e-05  [get_nets n91]
set_load 0.610573  [get_nets {rx_hold_reg[8]}]
set_resistance 1.4251e-05  [get_nets {rx_hold_reg[8]}]
set_load 0.441274  [get_nets n90]
set_resistance 9.81086e-06  [get_nets n90]
set_load 2.16671  [get_nets {rx_hold_reg[9]}]
set_resistance 4.72861e-05  [get_nets {rx_hold_reg[9]}]
set_load 0.52647  [get_nets n89]
set_resistance 9.5332e-06  [get_nets n89]
set_load 0.733849  [get_nets {rx_hold_reg[10]}]
set_resistance 1.75422e-05  [get_nets {rx_hold_reg[10]}]
set_load 0.593132  [get_nets n88]
set_resistance 1.02603e-05  [get_nets n88]
set_load 2.07082  [get_nets {rx_hold_reg[11]}]
set_resistance 4.2164e-05  [get_nets {rx_hold_reg[11]}]
set_load 0.354481  [get_nets n87]
set_resistance 8.99734e-06  [get_nets n87]
set_load 0.353783  [get_nets n143]
set_resistance 8.56694e-06  [get_nets n143]
set_load 0.226888  [get_nets n142]
set_resistance 5.64968e-06  [get_nets n142]
set_load 3.22741  [get_nets N6]
set_resistance 5.94574e-05  [get_nets N6]
set_load 0.246326  [get_nets n146]
set_resistance 6.58048e-06  [get_nets n146]
set_load 0.562556  [get_nets n140]
set_resistance 1.2046e-05  [get_nets n140]
set_load 0.641311  [get_nets n145]
set_resistance 1.46573e-05  [get_nets n145]
set_load 0.288191  [get_nets n141]
set_resistance 6.99247e-06  [get_nets n141]
set_load 1.88524  [get_nets {psa[0]}]
set_resistance 3.85073e-05  [get_nets {psa[0]}]
set_load 1.43415  [get_nets n144]
set_resistance 3.20958e-05  [get_nets n144]
set_load 1.33963  [get_nets {psa[1]}]
set_resistance 2.67302e-05  [get_nets {psa[1]}]
set_load 2.11837  [get_nets {psa[2]}]
set_resistance 4.44663e-05  [get_nets {psa[2]}]
set_load 1.95849  [get_nets {psa[3]}]
set_resistance 4.14089e-05  [get_nets {psa[3]}]
set_load 0.39105  [get_nets n139]
set_resistance 9.60727e-06  [get_nets n139]
set_load 0.272657  [get_nets n138]
set_resistance 5.76828e-06  [get_nets n138]
set_load 1.28058  [get_nets {psa[4]}]
set_resistance 2.80803e-05  [get_nets {psa[4]}]
set_load 0.858617  [get_nets {psa[5]}]
set_resistance 2.02271e-05  [get_nets {psa[5]}]
set_load 0.723696  [get_nets {psa[6]}]
set_resistance 1.68435e-05  [get_nets {psa[6]}]
set_load 1.04923  [get_nets {psa[7]}]
set_resistance 2.4015e-05  [get_nets {psa[7]}]
set_load 1.66079  [get_nets n20]
set_resistance 3.24645e-05  [get_nets n20]
set_load 1.18693  [get_nets psync]
set_resistance 2.42424e-05  [get_nets psync]
set_load 1.31631  [get_nets n21]
set_resistance 2.9555e-05  [get_nets n21]
set_load 0.713623  [get_nets n9]
set_resistance 1.29571e-05  [get_nets n9]
set_load 2.14201  [get_nets n19]
set_resistance 4.41331e-05  [get_nets n19]
set_load 0.630443  [get_nets n13]
set_resistance 1.44995e-05  [get_nets n13]
set_load 2.71014  [get_nets n155]
set_resistance 5.06364e-05  [get_nets n155]
set_load 0.402007  [get_nets n14]
set_resistance 8.88549e-06  [get_nets n14]
set_load 3.20852  [get_nets n1]
set_resistance 6.84756e-05  [get_nets n1]
set_load 4.06676  [get_nets pcm_dout_o]
set_resistance 8.76526e-05  [get_nets pcm_dout_o]
set_load 8.23765  [get_nets re_i]
set_resistance 0.000165815  [get_nets re_i]
set_load 1.32413  [get_nets pcm_din_i]
set_resistance 2.96972e-05  [get_nets pcm_din_i]
set_load 1.67491  [get_nets pcm_sync_i]
set_resistance 3.53976e-05  [get_nets pcm_sync_i]
set_load 1.0212  [get_nets pcm_clk_i]
set_resistance 2.3458e-05  [get_nets pcm_clk_i]
set_load 5.26473  [get_nets rst]
set_resistance 0.000105515  [get_nets rst]
set_load 28.942  [get_nets clk]
set_resistance 0.00070402  [get_nets clk]
set_load 8.86668  [get_nets {we_i[1]}]
set_resistance 0.00019249  [get_nets {we_i[1]}]
set_load 9.04499  [get_nets {we_i[0]}]
set_resistance 0.000185242  [get_nets {we_i[0]}]
set_load 2.72002  [get_nets {dout_o[7]}]
set_resistance 5.70578e-05  [get_nets {dout_o[7]}]
set_load 1.68365  [get_nets {dout_o[6]}]
set_resistance 3.90356e-05  [get_nets {dout_o[6]}]
set_load 2.00365  [get_nets {dout_o[5]}]
set_resistance 4.35821e-05  [get_nets {dout_o[5]}]
set_load 1.91285  [get_nets {dout_o[4]}]
set_resistance 4.31284e-05  [get_nets {dout_o[4]}]
set_load 3.08693  [get_nets {dout_o[3]}]
set_resistance 6.78791e-05  [get_nets {dout_o[3]}]
set_load 4.78412  [get_nets {dout_o[2]}]
set_resistance 9.67903e-05  [get_nets {dout_o[2]}]
set_load 3.27744  [get_nets {dout_o[1]}]
set_resistance 7.18816e-05  [get_nets {dout_o[1]}]
set_load 2.37623  [get_nets {dout_o[0]}]
set_resistance 5.413e-05  [get_nets {dout_o[0]}]
set_load 2.14522  [get_nets {din_i[7]}]
set_resistance 4.32035e-05  [get_nets {din_i[7]}]
set_load 3.28465  [get_nets {din_i[6]}]
set_resistance 6.80842e-05  [get_nets {din_i[6]}]
set_load 3.23777  [get_nets {din_i[5]}]
set_resistance 7.15435e-05  [get_nets {din_i[5]}]
set_load 4.85687  [get_nets {din_i[4]}]
set_resistance 9.33882e-05  [get_nets {din_i[4]}]
set_load 2.28511  [get_nets {din_i[3]}]
set_resistance 5.13859e-05  [get_nets {din_i[3]}]
set_load 3.23998  [get_nets {din_i[2]}]
set_resistance 6.75732e-05  [get_nets {din_i[2]}]
set_load 1.72872  [get_nets {din_i[1]}]
set_resistance 3.79597e-05  [get_nets {din_i[1]}]
set_load 3.22018  [get_nets {din_i[0]}]
set_resistance 6.84178e-05  [get_nets {din_i[0]}]
set_load 1.55549  [get_nets N5]
set_resistance 3.58181e-05  [get_nets N5]
set_load 2.43482  [get_nets N4]
set_resistance 5.64717e-05  [get_nets N4]
set_load 3.74993  [get_nets N3]
set_resistance 8.40221e-05  [get_nets N3]
set_load 4.58579  [get_nets n2]
set_resistance 9.83794e-05  [get_nets n2]
set_load 5.3158  [get_nets n4]
set_resistance 9.69942e-05  [get_nets n4]
set_load 5.78311  [get_nets n5]
set_resistance 0.000120484  [get_nets n5]
set_load 6.43339  [get_nets n6]
set_resistance 0.000133064  [get_nets n6]
set_load 4.97964  [get_nets n7]
set_resistance 0.000106455  [get_nets n7]
set_load 5.91199  [get_nets n8]
set_resistance 0.000123655  [get_nets n8]
set_load 1.55366  [get_nets n10]
set_resistance 3.52946e-05  [get_nets n10]
set_load 4.97818  [get_nets n11]
set_resistance 0.000105503  [get_nets n11]
set_load 4.80478  [get_nets n12]
set_resistance 0.000102567  [get_nets n12]
set_load 5.3627  [get_nets n15]
set_resistance 0.000105951  [get_nets n15]
set_load 6.35781  [get_nets n16]
set_resistance 0.000125633  [get_nets n16]
