###################################################################

# Created by write_sdc on Tue May  6 09:31:54 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports clk]
set_input_delay -clock clk  0.01  [get_ports rst]
set_input_delay -clock clk  0.01  [get_ports rxd_i]
set_input_delay -clock clk  0.01  [get_ports cts_i]
set_input_delay -clock clk  0.01  [get_ports sio_ce]
set_input_delay -clock clk  0.01  [get_ports sio_ce_x4]
set_input_delay -clock clk  0.01  [get_ports {din_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {din_i[0]}]
set_input_delay -clock clk  0.01  [get_ports re_i]
set_input_delay -clock clk  0.01  [get_ports we_i]
set_output_delay -clock clk  0.01  [get_ports txd_o]
set_output_delay -clock clk  0.01  [get_ports rts_o]
set_output_delay -clock clk  0.01  [get_ports {dout_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {dout_o[0]}]
set_output_delay -clock clk  0.01  [get_ports full_o]
set_output_delay -clock clk  0.01  [get_ports empty_o]
set_load 0.162447  [get_nets n104]
set_resistance 4.29026e-06  [get_nets n104]
set_load 0.547495  [get_nets n132]
set_resistance 1.17873e-05  [get_nets n132]
set_load 0.348888  [get_nets n96]
set_resistance 8.18575e-06  [get_nets n96]
set_load 0.502404  [get_nets load]
set_resistance 1.22368e-05  [get_nets load]
set_load 0.514865  [get_nets n64]
set_resistance 1.15955e-05  [get_nets n64]
set_load 0.760487  [get_nets rx_go]
set_resistance 1.66032e-05  [get_nets rx_go]
set_load 2.48971  [get_nets n48]
set_resistance 5.7147e-05  [get_nets n48]
set_load 0.959592  [get_nets n12]
set_resistance 1.9137e-05  [get_nets n12]
set_load 0.624824  [get_nets n88]
set_resistance 1.42655e-05  [get_nets n88]
set_load 0.184489  [get_nets n74]
set_resistance 5.16549e-06  [get_nets n74]
set_load 0.573147  [get_nets n73]
set_resistance 1.33964e-05  [get_nets n73]
set_load 0.27184  [get_nets n72]
set_resistance 7.64628e-06  [get_nets n72]
set_load 0.363968  [get_nets n71]
set_resistance 9.60235e-06  [get_nets n71]
set_load 0.274273  [get_nets n70]
set_resistance 5.91359e-06  [get_nets n70]
set_load 0.244088  [get_nets n69]
set_resistance 6.36084e-06  [get_nets n69]
set_load 0.572823  [get_nets n68]
set_resistance 1.39405e-05  [get_nets n68]
set_load 1.08257  [get_nets n67]
set_resistance 2.28087e-05  [get_nets n67]
set_load 0.480011  [get_nets n6]
set_resistance 1.02698e-05  [get_nets n6]
set_load 0.749606  [get_nets n7]
set_resistance 1.52986e-05  [get_nets n7]
set_load 0.520991  [get_nets n87]
set_resistance 1.23249e-05  [get_nets n87]
set_load 0.597042  [get_nets {rx_bit_cnt[2]}]
set_resistance 1.30966e-05  [get_nets {rx_bit_cnt[2]}]
set_load 0.37637  [get_nets n2]
set_resistance 9.13939e-06  [get_nets n2]
set_load 0.231732  [get_nets n1]
set_resistance 6.37292e-06  [get_nets n1]
set_load 0.438697  [get_nets n112]
set_resistance 1.09175e-05  [get_nets n112]
set_load 0.274804  [get_nets n86]
set_resistance 7.17265e-06  [get_nets n86]
set_load 0.584926  [get_nets n13]
set_resistance 1.07349e-05  [get_nets n13]
set_load 0.705682  [get_nets n10]
set_resistance 1.429e-05  [get_nets n10]
set_load 0.87767  [get_nets n89]
set_resistance 1.39529e-05  [get_nets n89]
set_load 0.270421  [get_nets n110]
set_resistance 5.30799e-06  [get_nets n110]
set_load 0.376518  [get_nets n14]
set_resistance 7.91079e-06  [get_nets n14]
set_load 0.288891  [get_nets n82]
set_resistance 7.18479e-06  [get_nets n82]
set_load 0.344029  [get_nets rx_valid_r]
set_resistance 9.2673e-06  [get_nets rx_valid_r]
set_load 0.213247  [get_nets n20]
set_resistance 6.29211e-06  [get_nets n20]
set_load 0.375192  [get_nets n91]
set_resistance 9.87488e-06  [get_nets n91]
set_load 0.742679  [get_nets n84]
set_resistance 1.44043e-05  [get_nets n84]
set_load 0.722446  [get_nets rx_sio_ce_r1]
set_resistance 1.54488e-05  [get_nets rx_sio_ce_r1]
set_load 0.31053  [get_nets n66]
set_resistance 7.38162e-06  [get_nets n66]
set_load 0.564129  [get_nets rx_valid]
set_resistance 1.27922e-05  [get_nets rx_valid]
set_load 0.867137  [get_nets {dpll_state[0]}]
set_resistance 1.91658e-05  [get_nets {dpll_state[0]}]
set_load 1.36851  [get_nets n65]
set_resistance 2.79204e-05  [get_nets n65]
set_load 0.511812  [get_nets N123]
set_resistance 1.00014e-05  [get_nets N123]
set_load 0.221513  [get_nets n85]
set_resistance 5.76132e-06  [get_nets n85]
set_load 0.342984  [get_nets N19]
set_resistance 8.1786e-06  [get_nets N19]
set_load 0.309355  [get_nets n121]
set_resistance 7.71919e-06  [get_nets n121]
set_load 0.289123  [get_nets n49]
set_resistance 6.20098e-06  [get_nets n49]
set_load 0.538097  [get_nets n50]
set_resistance 1.08899e-05  [get_nets n50]
set_load 0.412312  [get_nets n77]
set_resistance 9.87488e-06  [get_nets n77]
set_load 1.24645  [get_nets n106]
set_resistance 2.62114e-05  [get_nets n106]
set_load 1.87519  [get_nets {rx_bit_cnt[3]}]
set_resistance 3.73724e-05  [get_nets {rx_bit_cnt[3]}]
set_load 1.09946  [get_nets n109]
set_resistance 2.2271e-05  [get_nets n109]
set_load 1.1191  [get_nets n107]
set_resistance 2.48832e-05  [get_nets n107]
set_load 1.41233  [get_nets {rx_bit_cnt[0]}]
set_resistance 2.84668e-05  [get_nets {rx_bit_cnt[0]}]
set_load 0.650364  [get_nets {rx_bit_cnt[1]}]
set_resistance 1.52763e-05  [get_nets {rx_bit_cnt[1]}]
set_load 1.07933  [get_nets n108]
set_resistance 2.02611e-05  [get_nets n108]
set_load 0.167013  [get_nets N128]
set_resistance 2.3945e-06  [get_nets N128]
set_load 2.40404  [get_nets rxd_s]
set_resistance 4.75993e-05  [get_nets rxd_s]
set_load 0.540505  [get_nets n63]
set_resistance 1.25197e-05  [get_nets n63]
set_load 0.561995  [get_nets n79]
set_resistance 1.36698e-05  [get_nets n79]
set_load 1.21982  [get_nets n81]
set_resistance 2.39141e-05  [get_nets n81]
set_load 0.572145  [get_nets shift_en_r]
set_resistance 1.36482e-05  [get_nets shift_en_r]
set_load 3.24005  [get_nets n37]
set_resistance 7.28069e-05  [get_nets n37]
set_load 1.43646  [get_nets n124]
set_resistance 3.0852e-05  [get_nets n124]
set_load 0.326901  [get_nets n97]
set_resistance 8.17998e-06  [get_nets n97]
set_load 0.718489  [get_nets n125]
set_resistance 1.652e-05  [get_nets n125]
set_load 0.35014  [get_nets n98]
set_resistance 7.99129e-06  [get_nets n98]
set_load 0.847571  [get_nets n126]
set_resistance 1.91507e-05  [get_nets n126]
set_load 0.57043  [get_nets n99]
set_resistance 1.17652e-05  [get_nets n99]
set_load 1.02768  [get_nets n127]
set_resistance 2.36834e-05  [get_nets n127]
set_load 0.570812  [get_nets n100]
set_resistance 1.34005e-05  [get_nets n100]
set_load 0.556357  [get_nets n128]
set_resistance 1.35436e-05  [get_nets n128]
set_load 0.644881  [get_nets n101]
set_resistance 1.31188e-05  [get_nets n101]
set_load 1.0988  [get_nets n129]
set_resistance 2.44515e-05  [get_nets n129]
set_load 0.459346  [get_nets n102]
set_resistance 7.99129e-06  [get_nets n102]
set_load 0.800144  [get_nets n130]
set_resistance 1.84123e-05  [get_nets n130]
set_load 0.573856  [get_nets n103]
set_resistance 1.27438e-05  [get_nets n103]
set_load 2.56305  [get_nets n131]
set_resistance 5.57861e-05  [get_nets n131]
set_load 1.60107  [get_nets n115]
set_resistance 3.63008e-05  [get_nets n115]
set_load 0.505483  [get_nets n26]
set_resistance 1.26362e-05  [get_nets n26]
set_load 0.971927  [get_nets n122]
set_resistance 1.88762e-05  [get_nets n122]
set_load 1.03015  [get_nets n123]
set_resistance 2.28424e-05  [get_nets n123]
set_load 0.994554  [get_nets n31]
set_resistance 2.42258e-05  [get_nets n31]
set_load 1.18526  [get_nets n117]
set_resistance 2.54037e-05  [get_nets n117]
set_load 0.288984  [get_nets n22]
set_resistance 6.77426e-06  [get_nets n22]
set_load 0.918438  [get_nets n111]
set_resistance 1.73458e-05  [get_nets n111]
set_load 0.757674  [get_nets n25]
set_resistance 1.53821e-05  [get_nets n25]
set_load 0.983318  [get_nets n29]
set_resistance 1.88911e-05  [get_nets n29]
set_load 0.514853  [get_nets n30]
set_resistance 1.18767e-05  [get_nets n30]
set_load 0.49347  [get_nets n34]
set_resistance 1.09859e-05  [get_nets n34]
set_load 0.223818  [get_nets n95]
set_resistance 5.81909e-06  [get_nets n95]
set_load 1.39979  [get_nets {tx_bit_cnt[0]}]
set_resistance 2.99751e-05  [get_nets {tx_bit_cnt[0]}]
set_load 1.8033  [get_nets n47]
set_resistance 3.73708e-05  [get_nets n47]
set_load 1.93393  [get_nets n33]
set_resistance 4.37448e-05  [get_nets n33]
set_load 1.57482  [get_nets shift_en]
set_resistance 3.61658e-05  [get_nets shift_en]
set_load 0.463765  [get_nets n21]
set_resistance 1.00715e-05  [get_nets n21]
set_load 0.498286  [get_nets {tx_bit_cnt[3]}]
set_resistance 1.11615e-05  [get_nets {tx_bit_cnt[3]}]
set_load 0.577345  [get_nets n92]
set_resistance 1.31388e-05  [get_nets n92]
set_load 0.486813  [get_nets {tx_bit_cnt[2]}]
set_resistance 1.15281e-05  [get_nets {tx_bit_cnt[2]}]
set_load 0.315867  [get_nets n113]
set_resistance 7.66324e-06  [get_nets n113]
set_load 0.407793  [get_nets n93]
set_resistance 1.01445e-05  [get_nets n93]
set_load 0.664585  [get_nets n118]
set_resistance 1.6033e-05  [get_nets n118]
set_load 0.514152  [get_nets n90]
set_resistance 1.13172e-05  [get_nets n90]
set_load 0.628945  [get_nets n18]
set_resistance 1.18127e-05  [get_nets n18]
set_load 0.876729  [get_nets txf_empty_r]
set_resistance 1.69493e-05  [get_nets txf_empty_r]
set_load 0.428045  [get_nets n105]
set_resistance 1.04516e-05  [get_nets n105]
set_load 0.194223  [get_nets n32]
set_resistance 5.16549e-06  [get_nets n32]
set_load 0.474571  [get_nets n94]
set_resistance 1.09683e-05  [get_nets n94]
set_load 0.245064  [get_nets {tx_bit_cnt[1]}]
set_resistance 6.57196e-06  [get_nets {tx_bit_cnt[1]}]
set_load 1.01272  [get_nets n83]
set_resistance 2.41644e-05  [get_nets n83]
set_load 0.232514  [get_nets n54]
set_resistance 5.31213e-06  [get_nets n54]
set_load 0.341454  [get_nets n52]
set_resistance 8.51916e-06  [get_nets n52]
set_load 1.44484  [get_nets {dpll_state[1]}]
set_resistance 3.03066e-05  [get_nets {dpll_state[1]}]
set_load 0.40053  [get_nets n78]
set_resistance 9.11095e-06  [get_nets n78]
set_load 0.688949  [get_nets n15]
set_resistance 1.62888e-05  [get_nets n15]
set_load 4.97097  [get_nets empty_o]
set_resistance 0.000103149  [get_nets empty_o]
set_load 1.30709  [get_nets full_o]
set_resistance 2.69833e-05  [get_nets full_o]
set_load 0.867514  [get_nets rts_o]
set_resistance 2.04918e-05  [get_nets rts_o]
set_load 1.3951  [get_nets txd_o]
set_resistance 3.08923e-05  [get_nets txd_o]
set_load 5.36861  [get_nets we_i]
set_resistance 0.000103176  [get_nets we_i]
set_load 1.8989  [get_nets re_i]
set_resistance 4.29255e-05  [get_nets re_i]
set_load 3.54742  [get_nets sio_ce_x4]
set_resistance 6.96381e-05  [get_nets sio_ce_x4]
set_load 5.57062  [get_nets sio_ce]
set_resistance 0.000120881  [get_nets sio_ce]
set_load 3.88539  [get_nets cts_i]
set_resistance 6.53322e-05  [get_nets cts_i]
set_load 1.13356  [get_nets rxd_i]
set_resistance 2.423e-05  [get_nets rxd_i]
set_load 10.2797  [get_nets rst]
set_resistance 0.00021475  [get_nets rst]
set_load 40.2699  [get_nets clk]
set_resistance 0.00095947  [get_nets clk]
set_load 1.71928  [get_nets {dout_o[7]}]
set_resistance 3.83452e-05  [get_nets {dout_o[7]}]
set_load 3.04917  [get_nets {dout_o[6]}]
set_resistance 6.45813e-05  [get_nets {dout_o[6]}]
set_load 5.43718  [get_nets {dout_o[5]}]
set_resistance 0.000120649  [get_nets {dout_o[5]}]
set_load 4.06031  [get_nets {dout_o[4]}]
set_resistance 9.22664e-05  [get_nets {dout_o[4]}]
set_load 2.81841  [get_nets {dout_o[3]}]
set_resistance 6.2276e-05  [get_nets {dout_o[3]}]
set_load 1.61262  [get_nets {dout_o[2]}]
set_resistance 3.59403e-05  [get_nets {dout_o[2]}]
set_load 1.97535  [get_nets {dout_o[1]}]
set_resistance 3.97955e-05  [get_nets {dout_o[1]}]
set_load 1.4  [get_nets {dout_o[0]}]
set_resistance 3.21577e-05  [get_nets {dout_o[0]}]
set_load 5.86423  [get_nets {din_i[7]}]
set_resistance 0.000123512  [get_nets {din_i[7]}]
set_load 4.92622  [get_nets {din_i[6]}]
set_resistance 0.000107241  [get_nets {din_i[6]}]
set_load 3.73281  [get_nets {din_i[5]}]
set_resistance 8.00099e-05  [get_nets {din_i[5]}]
set_load 3.12198  [get_nets {din_i[4]}]
set_resistance 6.23636e-05  [get_nets {din_i[4]}]
set_load 2.09667  [get_nets {din_i[3]}]
set_resistance 4.50606e-05  [get_nets {din_i[3]}]
set_load 2.92543  [get_nets {din_i[2]}]
set_resistance 5.94051e-05  [get_nets {din_i[2]}]
set_load 2.74246  [get_nets {din_i[1]}]
set_resistance 5.82562e-05  [get_nets {din_i[1]}]
set_load 3.49063  [get_nets {din_i[0]}]
set_resistance 7.79175e-05  [get_nets {din_i[0]}]
set_load 3.43879  [get_nets {rxr[2]}]
set_resistance 6.80218e-05  [get_nets {rxr[2]}]
set_load 3.22914  [get_nets {rxr[3]}]
set_resistance 6.8701e-05  [get_nets {rxr[3]}]
set_load 2.68902  [get_nets {rxr[4]}]
set_resistance 6.05791e-05  [get_nets {rxr[4]}]
set_load 3.88643  [get_nets {rxr[5]}]
set_resistance 7.834e-05  [get_nets {rxr[5]}]
set_load 2.39948  [get_nets {rxr[6]}]
set_resistance 4.78226e-05  [get_nets {rxr[6]}]
set_load 2.36409  [get_nets {rxr[7]}]
set_resistance 5.41432e-05  [get_nets {rxr[7]}]
set_load 3.56352  [get_nets {rxr[8]}]
set_resistance 7.37244e-05  [get_nets {rxr[8]}]
set_load 3.37874  [get_nets {rxr[9]}]
set_resistance 7.1502e-05  [get_nets {rxr[9]}]
set_load 3.60834  [get_nets rx_we]
set_resistance 8.00903e-05  [get_nets rx_we]
set_load 2.11689  [get_nets rxf_full]
set_resistance 4.86178e-05  [get_nets rxf_full]
set_load 1.27842  [get_nets {txd_p[0]}]
set_resistance 2.26113e-05  [get_nets {txd_p[0]}]
set_load 0.72278  [get_nets {txd_p[1]}]
set_resistance 1.21273e-05  [get_nets {txd_p[1]}]
set_load 0.669354  [get_nets {txd_p[2]}]
set_resistance 1.31955e-05  [get_nets {txd_p[2]}]
set_load 0.878649  [get_nets {txd_p[3]}]
set_resistance 1.85133e-05  [get_nets {txd_p[3]}]
set_load 0.555601  [get_nets {txd_p[4]}]
set_resistance 1.25825e-05  [get_nets {txd_p[4]}]
set_load 1.12967  [get_nets {txd_p[5]}]
set_resistance 2.15267e-05  [get_nets {txd_p[5]}]
set_load 0.751662  [get_nets {txd_p[6]}]
set_resistance 1.28589e-05  [get_nets {txd_p[6]}]
set_load 0.798132  [get_nets {txd_p[7]}]
set_resistance 1.46093e-05  [get_nets {txd_p[7]}]
set_load 1.61327  [get_nets txf_empty]
set_resistance 2.74258e-05  [get_nets txf_empty]
set_load 3.46877  [get_nets n3]
set_resistance 6.97001e-05  [get_nets n3]
set_load 2.43057  [get_nets n4]
set_resistance 5.47351e-05  [get_nets n4]
set_load 4.36383  [get_nets n5]
set_resistance 9.11666e-05  [get_nets n5]
set_load 2.92304  [get_nets n8]
set_resistance 6.66535e-05  [get_nets n8]
set_load 0.182865  [get_nets rx_fifo/n93]
set_resistance 5.28223e-06  [get_nets rx_fifo/n93]
set_load 0.44066  [get_nets rx_fifo/n94]
set_resistance 1.09683e-05  [get_nets rx_fifo/n94]
set_load 0.432957  [get_nets rx_fifo/n95]
set_resistance 8.97738e-06  [get_nets rx_fifo/n95]
set_load 0.52802  [get_nets rx_fifo/n96]
set_resistance 9.63879e-06  [get_nets rx_fifo/n96]
set_load 0.603457  [get_nets rx_fifo/n97]
set_resistance 1.11666e-05  [get_nets rx_fifo/n97]
set_load 0.447613  [get_nets rx_fifo/n98]
set_resistance 9.04079e-06  [get_nets rx_fifo/n98]
set_load 0.531313  [get_nets rx_fifo/n99]
set_resistance 1.09663e-05  [get_nets rx_fifo/n99]
set_load 0.774594  [get_nets rx_fifo/n100]
set_resistance 1.25209e-05  [get_nets rx_fifo/n100]
set_load 0.342178  [get_nets rx_fifo/n109]
set_resistance 7.12502e-06  [get_nets rx_fifo/n109]
set_load 0.48962  [get_nets rx_fifo/n110]
set_resistance 9.93977e-06  [get_nets rx_fifo/n110]
set_load 0.54146  [get_nets rx_fifo/n111]
set_resistance 1.09683e-05  [get_nets rx_fifo/n111]
set_load 0.501932  [get_nets rx_fifo/n112]
set_resistance 9.57744e-06  [get_nets rx_fifo/n112]
set_load 0.338864  [get_nets rx_fifo/n113]
set_resistance 6.90021e-06  [get_nets rx_fifo/n113]
set_load 0.551386  [get_nets rx_fifo/n114]
set_resistance 1.20407e-05  [get_nets rx_fifo/n114]
set_load 0.664035  [get_nets rx_fifo/n115]
set_resistance 1.3196e-05  [get_nets rx_fifo/n115]
set_load 0.49635  [get_nets rx_fifo/n116]
set_resistance 1.12281e-05  [get_nets rx_fifo/n116]
set_load 0.396922  [get_nets rx_fifo/n81]
set_resistance 9.26779e-06  [get_nets rx_fifo/n81]
set_load 0.333001  [get_nets rx_fifo/n133]
set_resistance 6.61428e-06  [get_nets rx_fifo/n133]
set_load 0.440804  [get_nets rx_fifo/n134]
set_resistance 8.26086e-06  [get_nets rx_fifo/n134]
set_load 0.436768  [get_nets rx_fifo/n132]
set_resistance 9.25698e-06  [get_nets rx_fifo/n132]
set_load 0.355231  [get_nets rx_fifo/n135]
set_resistance 6.16137e-06  [get_nets rx_fifo/n135]
set_load 0.65995  [get_nets rx_fifo/gb]
set_resistance 1.38912e-05  [get_nets rx_fifo/gb]
set_load 0.497992  [get_nets rx_fifo/n117]
set_resistance 1.11649e-05  [get_nets rx_fifo/n117]
set_load 1.09723  [get_nets rx_fifo/n131]
set_resistance 2.24645e-05  [get_nets rx_fifo/n131]
set_load 0.704632  [get_nets rx_fifo/n138]
set_resistance 1.68358e-05  [get_nets rx_fifo/n138]
set_load 4.49508  [get_nets rx_fifo/n125]
set_resistance 9.44527e-05  [get_nets rx_fifo/n125]
set_load 4.52207  [get_nets rx_fifo/n128]
set_resistance 9.31888e-05  [get_nets rx_fifo/n128]
set_load 0.641606  [get_nets rx_fifo/n85]
set_resistance 1.37275e-05  [get_nets rx_fifo/n85]
set_load 0.350954  [get_nets rx_fifo/n86]
set_resistance 8.25641e-06  [get_nets rx_fifo/n86]
set_load 0.227256  [get_nets rx_fifo/n87]
set_resistance 4.79276e-06  [get_nets rx_fifo/n87]
set_load 0.729816  [get_nets rx_fifo/n88]
set_resistance 1.45401e-05  [get_nets rx_fifo/n88]
set_load 0.621949  [get_nets rx_fifo/n89]
set_resistance 1.23129e-05  [get_nets rx_fifo/n89]
set_load 0.472768  [get_nets rx_fifo/n90]
set_resistance 1.19668e-05  [get_nets rx_fifo/n90]
set_load 0.542062  [get_nets rx_fifo/n91]
set_resistance 9.61477e-06  [get_nets rx_fifo/n91]
set_load 0.522161  [get_nets rx_fifo/n101]
set_resistance 1.00613e-05  [get_nets rx_fifo/n101]
set_load 0.563511  [get_nets rx_fifo/n102]
set_resistance 1.28675e-05  [get_nets rx_fifo/n102]
set_load 0.556533  [get_nets rx_fifo/n103]
set_resistance 1.2314e-05  [get_nets rx_fifo/n103]
set_load 0.330986  [get_nets rx_fifo/n104]
set_resistance 8.78962e-06  [get_nets rx_fifo/n104]
set_load 0.577763  [get_nets rx_fifo/n105]
set_resistance 1.25962e-05  [get_nets rx_fifo/n105]
set_load 0.510963  [get_nets rx_fifo/n106]
set_resistance 1.08647e-05  [get_nets rx_fifo/n106]
set_load 0.504392  [get_nets rx_fifo/n107]
set_resistance 1.10117e-05  [get_nets rx_fifo/n107]
set_load 0.304135  [get_nets rx_fifo/n92]
set_resistance 6.79589e-06  [get_nets rx_fifo/n92]
set_load 0.515005  [get_nets rx_fifo/n108]
set_resistance 1.19856e-05  [get_nets rx_fifo/n108]
set_load 4.9204  [get_nets rx_fifo/n126]
set_resistance 0.00010465  [get_nets rx_fifo/n126]
set_load 4.50908  [get_nets rx_fifo/n129]
set_resistance 9.04182e-05  [get_nets rx_fifo/n129]
set_load 0.906184  [get_nets rx_fifo/n2]
set_resistance 1.90366e-05  [get_nets rx_fifo/n2]
set_load 0.848101  [get_nets {rx_fifo/mem[0][1]}]
set_resistance 1.65356e-05  [get_nets {rx_fifo/mem[0][1]}]
set_load 1.15755  [get_nets {rx_fifo/mem[1][1]}]
set_resistance 2.15517e-05  [get_nets {rx_fifo/mem[1][1]}]
set_load 0.903708  [get_nets {rx_fifo/mem[2][1]}]
set_resistance 1.49309e-05  [get_nets {rx_fifo/mem[2][1]}]
set_load 0.741742  [get_nets {rx_fifo/mem[3][1]}]
set_resistance 1.76902e-05  [get_nets {rx_fifo/mem[3][1]}]
set_load 0.711276  [get_nets rx_fifo/n1]
set_resistance 1.60358e-05  [get_nets rx_fifo/n1]
set_load 0.763346  [get_nets {rx_fifo/mem[0][0]}]
set_resistance 1.73061e-05  [get_nets {rx_fifo/mem[0][0]}]
set_load 0.950045  [get_nets {rx_fifo/mem[1][0]}]
set_resistance 2.03926e-05  [get_nets {rx_fifo/mem[1][0]}]
set_load 0.407867  [get_nets {rx_fifo/mem[2][0]}]
set_resistance 1.07951e-05  [get_nets {rx_fifo/mem[2][0]}]
set_load 0.426124  [get_nets {rx_fifo/mem[3][0]}]
set_resistance 9.29435e-06  [get_nets {rx_fifo/mem[3][0]}]
set_load 2.11016  [get_nets rx_fifo/N9]
set_resistance 4.93013e-05  [get_nets rx_fifo/N9]
set_load 1.73028  [get_nets rx_fifo/n17]
set_resistance 3.64723e-05  [get_nets rx_fifo/n17]
set_load 2.30949  [get_nets rx_fifo/N8]
set_resistance 4.55679e-05  [get_nets rx_fifo/N8]
set_load 1.59661  [get_nets rx_fifo/n16]
set_resistance 3.49573e-05  [get_nets rx_fifo/n16]
set_load 1.90986  [get_nets rx_fifo/n79]
set_resistance 4.19035e-05  [get_nets rx_fifo/n79]
set_load 0.63488  [get_nets rx_fifo/n122]
set_resistance 1.5425e-05  [get_nets rx_fifo/n122]
set_load 1.47438  [get_nets {rx_fifo/wp[1]}]
set_resistance 3.47079e-05  [get_nets {rx_fifo/wp[1]}]
set_load 1.0278  [get_nets rx_fifo/n137]
set_resistance 2.42317e-05  [get_nets rx_fifo/n137]
set_load 0.773191  [get_nets rx_fifo/n130]
set_resistance 1.65647e-05  [get_nets rx_fifo/n130]
set_load 0.314207  [get_nets rx_fifo/n123]
set_resistance 6.16549e-06  [get_nets rx_fifo/n123]
set_load 0.436619  [get_nets rx_fifo/n124]
set_resistance 8.80241e-06  [get_nets rx_fifo/n124]
set_load 0.273829  [get_nets rx_fifo/n84]
set_resistance 7.37349e-06  [get_nets rx_fifo/n84]
set_load 1.48415  [get_nets rx_fifo/n80]
set_resistance 3.19929e-05  [get_nets rx_fifo/n80]
set_load 0.225493  [get_nets rx_fifo/n121]
set_resistance 5.28494e-06  [get_nets rx_fifo/n121]
set_load 0.471034  [get_nets rx_fifo/n83]
set_resistance 1.02603e-05  [get_nets rx_fifo/n83]
set_load 1.07497  [get_nets rx_fifo/n118]
set_resistance 2.54268e-05  [get_nets rx_fifo/n118]
set_load 0.316949  [get_nets rx_fifo/n136]
set_resistance 6.63422e-06  [get_nets rx_fifo/n136]
set_load 0.449795  [get_nets rx_fifo/n78]
set_resistance 1.03262e-05  [get_nets rx_fifo/n78]
set_load 0.417629  [get_nets rx_fifo/n119]
set_resistance 1.01176e-05  [get_nets rx_fifo/n119]
set_load 0.471281  [get_nets rx_fifo/n120]
set_resistance 1.04151e-05  [get_nets rx_fifo/n120]
set_load 0.224737  [get_nets rx_fifo/n82]
set_resistance 5.85349e-06  [get_nets rx_fifo/n82]
set_load 0.475301  [get_nets rx_fifo/n18]
set_resistance 1.10506e-05  [get_nets rx_fifo/n18]
set_load 1.07838  [get_nets {rx_fifo/wp[0]}]
set_resistance 2.53409e-05  [get_nets {rx_fifo/wp[0]}]
set_load 0.904125  [get_nets rx_fifo/n127]
set_resistance 2.24047e-05  [get_nets rx_fifo/n127]
set_load 0.567217  [get_nets rx_fifo/n11]
set_resistance 1.33303e-05  [get_nets rx_fifo/n11]
set_load 1.02166  [get_nets {rx_fifo/mem[0][7]}]
set_resistance 2.27594e-05  [get_nets {rx_fifo/mem[0][7]}]
set_load 5.46401  [get_nets rx_fifo/n13]
set_resistance 9.92618e-05  [get_nets rx_fifo/n13]
set_load 5.36929  [get_nets rx_fifo/n14]
set_resistance 0.000101164  [get_nets rx_fifo/n14]
set_load 0.826366  [get_nets {rx_fifo/mem[1][7]}]
set_resistance 1.79146e-05  [get_nets {rx_fifo/mem[1][7]}]
set_load 5.10297  [get_nets rx_fifo/n9]
set_resistance 8.79483e-05  [get_nets rx_fifo/n9]
set_load 0.795713  [get_nets {rx_fifo/mem[2][7]}]
set_resistance 1.62827e-05  [get_nets {rx_fifo/mem[2][7]}]
set_load 4.74785  [get_nets rx_fifo/n8]
set_resistance 8.82728e-05  [get_nets rx_fifo/n8]
set_load 0.74413  [get_nets {rx_fifo/mem[3][7]}]
set_resistance 1.61849e-05  [get_nets {rx_fifo/mem[3][7]}]
set_load 1.20733  [get_nets rx_fifo/n7]
set_resistance 2.0369e-05  [get_nets rx_fifo/n7]
set_load 1.00168  [get_nets {rx_fifo/mem[0][6]}]
set_resistance 2.05699e-05  [get_nets {rx_fifo/mem[0][6]}]
set_load 0.636711  [get_nets {rx_fifo/mem[1][6]}]
set_resistance 1.33563e-05  [get_nets {rx_fifo/mem[1][6]}]
set_load 0.917347  [get_nets {rx_fifo/mem[2][6]}]
set_resistance 2.17399e-05  [get_nets {rx_fifo/mem[2][6]}]
set_load 0.99712  [get_nets {rx_fifo/mem[3][6]}]
set_resistance 2.3258e-05  [get_nets {rx_fifo/mem[3][6]}]
set_load 0.805347  [get_nets rx_fifo/n6]
set_resistance 1.57595e-05  [get_nets rx_fifo/n6]
set_load 0.885299  [get_nets {rx_fifo/mem[0][5]}]
set_resistance 1.83134e-05  [get_nets {rx_fifo/mem[0][5]}]
set_load 1.24654  [get_nets {rx_fifo/mem[1][5]}]
set_resistance 2.42851e-05  [get_nets {rx_fifo/mem[1][5]}]
set_load 0.439566  [get_nets {rx_fifo/mem[2][5]}]
set_resistance 1.07294e-05  [get_nets {rx_fifo/mem[2][5]}]
set_load 0.78747  [get_nets {rx_fifo/mem[3][5]}]
set_resistance 1.4871e-05  [get_nets {rx_fifo/mem[3][5]}]
set_load 0.4749  [get_nets rx_fifo/n5]
set_resistance 1.05098e-05  [get_nets rx_fifo/n5]
set_load 0.829672  [get_nets {rx_fifo/mem[0][4]}]
set_resistance 1.81631e-05  [get_nets {rx_fifo/mem[0][4]}]
set_load 1.08279  [get_nets {rx_fifo/mem[1][4]}]
set_resistance 2.34792e-05  [get_nets {rx_fifo/mem[1][4]}]
set_load 0.706972  [get_nets {rx_fifo/mem[2][4]}]
set_resistance 1.52545e-05  [get_nets {rx_fifo/mem[2][4]}]
set_load 0.634451  [get_nets {rx_fifo/mem[3][4]}]
set_resistance 1.55656e-05  [get_nets {rx_fifo/mem[3][4]}]
set_load 1.17942  [get_nets rx_fifo/n4]
set_resistance 2.28503e-05  [get_nets rx_fifo/n4]
set_load 0.921298  [get_nets {rx_fifo/mem[0][3]}]
set_resistance 1.77977e-05  [get_nets {rx_fifo/mem[0][3]}]
set_load 0.534877  [get_nets {rx_fifo/mem[1][3]}]
set_resistance 1.29679e-05  [get_nets {rx_fifo/mem[1][3]}]
set_load 0.429415  [get_nets {rx_fifo/mem[2][3]}]
set_resistance 1.06164e-05  [get_nets {rx_fifo/mem[2][3]}]
set_load 0.759479  [get_nets {rx_fifo/mem[3][3]}]
set_resistance 1.60282e-05  [get_nets {rx_fifo/mem[3][3]}]
set_load 0.317227  [get_nets rx_fifo/n3]
set_resistance 8.17969e-06  [get_nets rx_fifo/n3]
set_load 0.472307  [get_nets {rx_fifo/mem[0][2]}]
set_resistance 1.20963e-05  [get_nets {rx_fifo/mem[0][2]}]
set_load 0.945085  [get_nets {rx_fifo/mem[1][2]}]
set_resistance 2.0619e-05  [get_nets {rx_fifo/mem[1][2]}]
set_load 0.376305  [get_nets {rx_fifo/mem[2][2]}]
set_resistance 1.03597e-05  [get_nets {rx_fifo/mem[2][2]}]
set_load 1.13197  [get_nets {rx_fifo/mem[3][2]}]
set_resistance 2.46154e-05  [get_nets {rx_fifo/mem[3][2]}]
set_load 3.43879  [get_nets {rx_fifo/din[0]}]
set_resistance 6.80218e-05  [get_nets {rx_fifo/din[0]}]
set_load 3.22914  [get_nets {rx_fifo/din[1]}]
set_resistance 6.8701e-05  [get_nets {rx_fifo/din[1]}]
set_load 2.68902  [get_nets {rx_fifo/din[2]}]
set_resistance 6.05791e-05  [get_nets {rx_fifo/din[2]}]
set_load 3.88643  [get_nets {rx_fifo/din[3]}]
set_resistance 7.834e-05  [get_nets {rx_fifo/din[3]}]
set_load 2.39948  [get_nets {rx_fifo/din[4]}]
set_resistance 4.78226e-05  [get_nets {rx_fifo/din[4]}]
set_load 2.36409  [get_nets {rx_fifo/din[5]}]
set_resistance 5.41432e-05  [get_nets {rx_fifo/din[5]}]
set_load 3.56352  [get_nets {rx_fifo/din[6]}]
set_resistance 7.37244e-05  [get_nets {rx_fifo/din[6]}]
set_load 3.37874  [get_nets {rx_fifo/din[7]}]
set_resistance 7.1502e-05  [get_nets {rx_fifo/din[7]}]
set_load 1.4  [get_nets {rx_fifo/dout[0]}]
set_resistance 3.21577e-05  [get_nets {rx_fifo/dout[0]}]
set_load 1.97535  [get_nets {rx_fifo/dout[1]}]
set_resistance 3.97955e-05  [get_nets {rx_fifo/dout[1]}]
set_load 1.61262  [get_nets {rx_fifo/dout[2]}]
set_resistance 3.59403e-05  [get_nets {rx_fifo/dout[2]}]
set_load 2.81841  [get_nets {rx_fifo/dout[3]}]
set_resistance 6.2276e-05  [get_nets {rx_fifo/dout[3]}]
set_load 4.06031  [get_nets {rx_fifo/dout[4]}]
set_resistance 9.22664e-05  [get_nets {rx_fifo/dout[4]}]
set_load 5.43718  [get_nets {rx_fifo/dout[5]}]
set_resistance 0.000120649  [get_nets {rx_fifo/dout[5]}]
set_load 3.04917  [get_nets {rx_fifo/dout[6]}]
set_resistance 6.45813e-05  [get_nets {rx_fifo/dout[6]}]
set_load 1.71928  [get_nets {rx_fifo/dout[7]}]
set_resistance 3.83452e-05  [get_nets {rx_fifo/dout[7]}]
set_load 40.2699  [get_nets rx_fifo/clk]
set_resistance 0.00095947  [get_nets rx_fifo/clk]
set_load 10.2797  [get_nets rx_fifo/rst]
set_resistance 0.00021475  [get_nets rx_fifo/rst]
set_load 3.60834  [get_nets rx_fifo/we]
set_resistance 8.00903e-05  [get_nets rx_fifo/we]
set_load 1.8989  [get_nets rx_fifo/re]
set_resistance 4.29255e-05  [get_nets rx_fifo/re]
set_load 2.11689  [get_nets rx_fifo/full]
set_resistance 4.86178e-05  [get_nets rx_fifo/full]
set_load 4.97097  [get_nets rx_fifo/empty]
set_resistance 0.000103149  [get_nets rx_fifo/empty]
set_load 3.91625  [get_nets rx_fifo/n10]
set_resistance 7.43325e-05  [get_nets rx_fifo/n10]
set_load 4.78846  [get_nets rx_fifo/n12]
set_resistance 8.7044e-05  [get_nets rx_fifo/n12]
set_load 3.50923  [get_nets rx_fifo/n15]
set_resistance 7.53332e-05  [get_nets rx_fifo/n15]
set_load 3.98829  [get_nets rx_fifo/n19]
set_resistance 7.95233e-05  [get_nets rx_fifo/n19]
set_load 0.590174  [get_nets tx_fifo/n51]
set_resistance 1.19773e-05  [get_nets tx_fifo/n51]
set_load 0.957087  [get_nets tx_fifo/n50]
set_resistance 1.96787e-05  [get_nets tx_fifo/n50]
set_load 0.310308  [get_nets tx_fifo/n49]
set_resistance 7.37349e-06  [get_nets tx_fifo/n49]
set_load 0.530731  [get_nets tx_fifo/n48]
set_resistance 1.11844e-05  [get_nets tx_fifo/n48]
set_load 0.515506  [get_nets tx_fifo/n47]
set_resistance 1.20428e-05  [get_nets tx_fifo/n47]
set_load 0.51078  [get_nets tx_fifo/n46]
set_resistance 1.12212e-05  [get_nets tx_fifo/n46]
set_load 0.33654  [get_nets tx_fifo/n31]
set_resistance 7.35349e-06  [get_nets tx_fifo/n31]
set_load 0.371716  [get_nets tx_fifo/n30]
set_resistance 7.95457e-06  [get_nets tx_fifo/n30]
set_load 0.311267  [get_nets tx_fifo/n70]
set_resistance 8.44428e-06  [get_nets tx_fifo/n70]
set_load 0.508822  [get_nets tx_fifo/n80]
set_resistance 1.21631e-05  [get_nets tx_fifo/n80]
set_load 0.110702  [get_nets tx_fifo/n33]
set_resistance 3.40942e-06  [get_nets tx_fifo/n33]
set_load 0.352355  [get_nets tx_fifo/n71]
set_resistance 8.40548e-06  [get_nets tx_fifo/n71]
set_load 5.70699  [get_nets tx_fifo/n28]
set_resistance 0.00010925  [get_nets tx_fifo/n28]
set_load 3.85715  [get_nets tx_fifo/n25]
set_resistance 8.20628e-05  [get_nets tx_fifo/n25]
set_load 0.32131  [get_nets tx_fifo/n61]
set_resistance 8.25641e-06  [get_nets tx_fifo/n61]
set_load 0.609257  [get_nets tx_fifo/n60]
set_resistance 1.20644e-05  [get_nets tx_fifo/n60]
set_load 0.324301  [get_nets tx_fifo/n59]
set_resistance 8.24893e-06  [get_nets tx_fifo/n59]
set_load 0.452375  [get_nets tx_fifo/n58]
set_resistance 9.58149e-06  [get_nets tx_fifo/n58]
set_load 0.377296  [get_nets tx_fifo/n57]
set_resistance 9.26834e-06  [get_nets tx_fifo/n57]
set_load 0.548594  [get_nets tx_fifo/n56]
set_resistance 1.19242e-05  [get_nets tx_fifo/n56]
set_load 0.467202  [get_nets tx_fifo/n55]
set_resistance 1.02286e-05  [get_nets tx_fifo/n55]
set_load 0.528643  [get_nets tx_fifo/n54]
set_resistance 1.22201e-05  [get_nets tx_fifo/n54]
set_load 0.383207  [get_nets tx_fifo/n45]
set_resistance 7.57377e-06  [get_nets tx_fifo/n45]
set_load 0.699255  [get_nets tx_fifo/n44]
set_resistance 1.47526e-05  [get_nets tx_fifo/n44]
set_load 0.56878  [get_nets tx_fifo/n43]
set_resistance 1.20312e-05  [get_nets tx_fifo/n43]
set_load 0.519619  [get_nets tx_fifo/n42]
set_resistance 1.14992e-05  [get_nets tx_fifo/n42]
set_load 0.651124  [get_nets tx_fifo/n41]
set_resistance 1.50598e-05  [get_nets tx_fifo/n41]
set_load 0.642215  [get_nets tx_fifo/n40]
set_resistance 1.32307e-05  [get_nets tx_fifo/n40]
set_load 0.508405  [get_nets tx_fifo/n39]
set_resistance 1.19833e-05  [get_nets tx_fifo/n39]
set_load 0.625112  [get_nets tx_fifo/n38]
set_resistance 1.17964e-05  [get_nets tx_fifo/n38]
set_load 0.382696  [get_nets tx_fifo/n21]
set_resistance 8.99734e-06  [get_nets tx_fifo/n21]
set_load 0.210299  [get_nets tx_fifo/n20]
set_resistance 4.99703e-06  [get_nets tx_fifo/n20]
set_load 0.431702  [get_nets tx_fifo/n22]
set_resistance 1.02473e-05  [get_nets tx_fifo/n22]
set_load 0.30093  [get_nets tx_fifo/n19]
set_resistance 7.39161e-06  [get_nets tx_fifo/n19]
set_load 0.479247  [get_nets tx_fifo/n37]
set_resistance 1.08347e-05  [get_nets tx_fifo/n37]
set_load 0.928585  [get_nets tx_fifo/n36]
set_resistance 1.83631e-05  [get_nets tx_fifo/n36]
set_load 1.44462  [get_nets tx_fifo/n12]
set_resistance 3.28278e-05  [get_nets tx_fifo/n12]
set_load 0.697623  [get_nets tx_fifo/n23]
set_resistance 1.55725e-05  [get_nets tx_fifo/n23]
set_load 0.754749  [get_nets tx_fifo/n24]
set_resistance 1.65978e-05  [get_nets tx_fifo/n24]
set_load 0.402192  [get_nets tx_fifo/n34]
set_resistance 8.02426e-06  [get_nets tx_fifo/n34]
set_load 0.330634  [get_nets tx_fifo/n72]
set_resistance 7.98538e-06  [get_nets tx_fifo/n72]
set_load 0.498189  [get_nets tx_fifo/n79]
set_resistance 1.25344e-05  [get_nets tx_fifo/n79]
set_load 0.930321  [get_nets {tx_fifo/wp[0]}]
set_resistance 2.09207e-05  [get_nets {tx_fifo/wp[0]}]
set_load 1.09085  [get_nets tx_fifo/n27]
set_resistance 2.60087e-05  [get_nets tx_fifo/n27]
set_load 0.596037  [get_nets tx_fifo/n73]
set_resistance 1.42119e-05  [get_nets tx_fifo/n73]
set_load 0.688627  [get_nets tx_fifo/gb]
set_resistance 1.57184e-05  [get_nets tx_fifo/gb]
set_load 0.328076  [get_nets tx_fifo/n18]
set_resistance 7.28477e-06  [get_nets tx_fifo/n18]
set_load 0.357222  [get_nets tx_fifo/n15]
set_resistance 9.06274e-06  [get_nets tx_fifo/n15]
set_load 0.652833  [get_nets tx_fifo/n10]
set_resistance 1.32217e-05  [get_nets tx_fifo/n10]
set_load 5.02032  [get_nets tx_fifo/n29]
set_resistance 0.000105772  [get_nets tx_fifo/n29]
set_load 5.28209  [get_nets tx_fifo/n26]
set_resistance 0.000103773  [get_nets tx_fifo/n26]
set_load 0.864221  [get_nets tx_fifo/n32]
set_resistance 1.98444e-05  [get_nets tx_fifo/n32]
set_load 0.509769  [get_nets tx_fifo/n69]
set_resistance 1.19701e-05  [get_nets tx_fifo/n69]
set_load 0.479112  [get_nets tx_fifo/n68]
set_resistance 1.10581e-05  [get_nets tx_fifo/n68]
set_load 0.50245  [get_nets tx_fifo/n67]
set_resistance 1.10683e-05  [get_nets tx_fifo/n67]
set_load 0.446896  [get_nets tx_fifo/n66]
set_resistance 8.20859e-06  [get_nets tx_fifo/n66]
set_load 0.620535  [get_nets tx_fifo/n65]
set_resistance 1.19638e-05  [get_nets tx_fifo/n65]
set_load 0.287747  [get_nets tx_fifo/n64]
set_resistance 7.11477e-06  [get_nets tx_fifo/n64]
set_load 0.581905  [get_nets tx_fifo/n63]
set_resistance 1.14389e-05  [get_nets tx_fifo/n63]
set_load 0.181611  [get_nets tx_fifo/n62]
set_resistance 4.9313e-06  [get_nets tx_fifo/n62]
set_load 0.577004  [get_nets tx_fifo/n53]
set_resistance 1.27939e-05  [get_nets tx_fifo/n53]
set_load 0.5862  [get_nets tx_fifo/n52]
set_resistance 1.29091e-05  [get_nets tx_fifo/n52]
set_load 0.729139  [get_nets {tx_fifo/mem[2][5]}]
set_resistance 1.57846e-05  [get_nets {tx_fifo/mem[2][5]}]
set_load 0.62052  [get_nets {tx_fifo/mem[3][5]}]
set_resistance 1.31111e-05  [get_nets {tx_fifo/mem[3][5]}]
set_load 0.762813  [get_nets tx_fifo/n5]
set_resistance 1.71937e-05  [get_nets tx_fifo/n5]
set_load 0.866926  [get_nets {tx_fifo/mem[0][4]}]
set_resistance 2.00318e-05  [get_nets {tx_fifo/mem[0][4]}]
set_load 0.720619  [get_nets {tx_fifo/mem[1][4]}]
set_resistance 1.78076e-05  [get_nets {tx_fifo/mem[1][4]}]
set_load 1.5181  [get_nets {tx_fifo/mem[2][4]}]
set_resistance 2.94425e-05  [get_nets {tx_fifo/mem[2][4]}]
set_load 0.534042  [get_nets {tx_fifo/mem[3][4]}]
set_resistance 1.21368e-05  [get_nets {tx_fifo/mem[3][4]}]
set_load 0.242293  [get_nets tx_fifo/n4]
set_resistance 6.56674e-06  [get_nets tx_fifo/n4]
set_load 0.874809  [get_nets {tx_fifo/mem[0][3]}]
set_resistance 1.83144e-05  [get_nets {tx_fifo/mem[0][3]}]
set_load 1.39631  [get_nets {tx_fifo/mem[1][3]}]
set_resistance 2.77371e-05  [get_nets {tx_fifo/mem[1][3]}]
set_load 1.02879  [get_nets {tx_fifo/mem[2][3]}]
set_resistance 2.33376e-05  [get_nets {tx_fifo/mem[2][3]}]
set_load 1.05658  [get_nets {tx_fifo/mem[3][3]}]
set_resistance 2.14845e-05  [get_nets {tx_fifo/mem[3][3]}]
set_load 0.666193  [get_nets tx_fifo/n3]
set_resistance 1.38744e-05  [get_nets tx_fifo/n3]
set_load 0.710383  [get_nets {tx_fifo/mem[0][2]}]
set_resistance 1.60365e-05  [get_nets {tx_fifo/mem[0][2]}]
set_load 0.487992  [get_nets {tx_fifo/mem[1][2]}]
set_resistance 1.19635e-05  [get_nets {tx_fifo/mem[1][2]}]
set_load 1.06151  [get_nets {tx_fifo/mem[2][2]}]
set_resistance 1.90432e-05  [get_nets {tx_fifo/mem[2][2]}]
set_load 0.346925  [get_nets {tx_fifo/mem[3][2]}]
set_resistance 7.90142e-06  [get_nets {tx_fifo/mem[3][2]}]
set_load 0.381236  [get_nets tx_fifo/n2]
set_resistance 6.61522e-06  [get_nets tx_fifo/n2]
set_load 0.915141  [get_nets {tx_fifo/mem[0][1]}]
set_resistance 2.06337e-05  [get_nets {tx_fifo/mem[0][1]}]
set_load 1.60431  [get_nets {tx_fifo/mem[1][1]}]
set_resistance 3.07839e-05  [get_nets {tx_fifo/mem[1][1]}]
set_load 0.577735  [get_nets {tx_fifo/mem[2][1]}]
set_resistance 1.38304e-05  [get_nets {tx_fifo/mem[2][1]}]
set_load 0.950181  [get_nets {tx_fifo/mem[3][1]}]
set_resistance 2.14455e-05  [get_nets {tx_fifo/mem[3][1]}]
set_load 0.592654  [get_nets tx_fifo/n1]
set_resistance 1.19779e-05  [get_nets tx_fifo/n1]
set_load 0.845727  [get_nets {tx_fifo/mem[0][0]}]
set_resistance 1.85142e-05  [get_nets {tx_fifo/mem[0][0]}]
set_load 0.556844  [get_nets {tx_fifo/mem[1][0]}]
set_resistance 1.21408e-05  [get_nets {tx_fifo/mem[1][0]}]
set_load 1.11118  [get_nets {tx_fifo/mem[2][0]}]
set_resistance 2.22933e-05  [get_nets {tx_fifo/mem[2][0]}]
set_load 1.19519  [get_nets {tx_fifo/mem[3][0]}]
set_resistance 2.27994e-05  [get_nets {tx_fifo/mem[3][0]}]
set_load 2.27852  [get_nets tx_fifo/N9]
set_resistance 4.97052e-05  [get_nets tx_fifo/N9]
set_load 1.29992  [get_nets tx_fifo/n14]
set_resistance 2.80339e-05  [get_nets tx_fifo/n14]
set_load 1.57429  [get_nets tx_fifo/N8]
set_resistance 3.79861e-05  [get_nets tx_fifo/N8]
set_load 1.54896  [get_nets tx_fifo/n13]
set_resistance 3.33764e-05  [get_nets tx_fifo/n13]
set_load 1.47758  [get_nets tx_fifo/n78]
set_resistance 3.00894e-05  [get_nets tx_fifo/n78]
set_load 0.534707  [get_nets tx_fifo/n35]
set_resistance 1.23343e-05  [get_nets tx_fifo/n35]
set_load 1.36957  [get_nets {tx_fifo/wp[1]}]
set_resistance 3.34793e-05  [get_nets {tx_fifo/wp[1]}]
set_load 0.188779  [get_nets tx_fifo/n11]
set_resistance 4.67868e-06  [get_nets tx_fifo/n11]
set_load 0.408637  [get_nets {tx_fifo/mem[0][7]}]
set_resistance 1.09305e-05  [get_nets {tx_fifo/mem[0][7]}]
set_load 4.53379  [get_nets tx_fifo/n16]
set_resistance 8.93306e-05  [get_nets tx_fifo/n16]
set_load 4.23272  [get_nets tx_fifo/n17]
set_resistance 8.46174e-05  [get_nets tx_fifo/n17]
set_load 0.680365  [get_nets {tx_fifo/mem[1][7]}]
set_resistance 1.71255e-05  [get_nets {tx_fifo/mem[1][7]}]
set_load 3.48532  [get_nets tx_fifo/n9]
set_resistance 7.1742e-05  [get_nets tx_fifo/n9]
set_load 0.367168  [get_nets {tx_fifo/mem[2][7]}]
set_resistance 1.00769e-05  [get_nets {tx_fifo/mem[2][7]}]
set_load 3.63152  [get_nets tx_fifo/n8]
set_resistance 7.26485e-05  [get_nets tx_fifo/n8]
set_load 0.585532  [get_nets {tx_fifo/mem[3][7]}]
set_resistance 1.2521e-05  [get_nets {tx_fifo/mem[3][7]}]
set_load 0.472387  [get_nets tx_fifo/n7]
set_resistance 9.448e-06  [get_nets tx_fifo/n7]
set_load 0.950139  [get_nets {tx_fifo/mem[0][6]}]
set_resistance 2.14917e-05  [get_nets {tx_fifo/mem[0][6]}]
set_load 0.514198  [get_nets {tx_fifo/mem[1][6]}]
set_resistance 1.19643e-05  [get_nets {tx_fifo/mem[1][6]}]
set_load 0.577894  [get_nets {tx_fifo/mem[2][6]}]
set_resistance 1.2651e-05  [get_nets {tx_fifo/mem[2][6]}]
set_load 0.5389  [get_nets {tx_fifo/mem[3][6]}]
set_resistance 1.0661e-05  [get_nets {tx_fifo/mem[3][6]}]
set_load 0.740417  [get_nets tx_fifo/n6]
set_resistance 1.63155e-05  [get_nets tx_fifo/n6]
set_load 0.79341  [get_nets {tx_fifo/mem[0][5]}]
set_resistance 1.76996e-05  [get_nets {tx_fifo/mem[0][5]}]
set_load 1.15629  [get_nets {tx_fifo/mem[1][5]}]
set_resistance 2.30677e-05  [get_nets {tx_fifo/mem[1][5]}]
set_load 3.49063  [get_nets {tx_fifo/din[0]}]
set_resistance 7.79175e-05  [get_nets {tx_fifo/din[0]}]
set_load 2.74246  [get_nets {tx_fifo/din[1]}]
set_resistance 5.82562e-05  [get_nets {tx_fifo/din[1]}]
set_load 2.92543  [get_nets {tx_fifo/din[2]}]
set_resistance 5.94051e-05  [get_nets {tx_fifo/din[2]}]
set_load 2.09667  [get_nets {tx_fifo/din[3]}]
set_resistance 4.50606e-05  [get_nets {tx_fifo/din[3]}]
set_load 3.12198  [get_nets {tx_fifo/din[4]}]
set_resistance 6.23636e-05  [get_nets {tx_fifo/din[4]}]
set_load 3.73281  [get_nets {tx_fifo/din[5]}]
set_resistance 8.00099e-05  [get_nets {tx_fifo/din[5]}]
set_load 4.92622  [get_nets {tx_fifo/din[6]}]
set_resistance 0.000107241  [get_nets {tx_fifo/din[6]}]
set_load 5.86423  [get_nets {tx_fifo/din[7]}]
set_resistance 0.000123512  [get_nets {tx_fifo/din[7]}]
set_load 1.27842  [get_nets {tx_fifo/dout[0]}]
set_resistance 2.26113e-05  [get_nets {tx_fifo/dout[0]}]
set_load 0.72278  [get_nets {tx_fifo/dout[1]}]
set_resistance 1.21273e-05  [get_nets {tx_fifo/dout[1]}]
set_load 0.669354  [get_nets {tx_fifo/dout[2]}]
set_resistance 1.31955e-05  [get_nets {tx_fifo/dout[2]}]
set_load 0.878649  [get_nets {tx_fifo/dout[3]}]
set_resistance 1.85133e-05  [get_nets {tx_fifo/dout[3]}]
set_load 0.555601  [get_nets {tx_fifo/dout[4]}]
set_resistance 1.25825e-05  [get_nets {tx_fifo/dout[4]}]
set_load 1.12967  [get_nets {tx_fifo/dout[5]}]
set_resistance 2.15267e-05  [get_nets {tx_fifo/dout[5]}]
set_load 0.751662  [get_nets {tx_fifo/dout[6]}]
set_resistance 1.28589e-05  [get_nets {tx_fifo/dout[6]}]
set_load 0.798132  [get_nets {tx_fifo/dout[7]}]
set_resistance 1.46093e-05  [get_nets {tx_fifo/dout[7]}]
set_load 40.2699  [get_nets tx_fifo/clk]
set_resistance 0.00095947  [get_nets tx_fifo/clk]
set_load 5.36861  [get_nets tx_fifo/we]
set_resistance 0.000103176  [get_nets tx_fifo/we]
set_load 1.30709  [get_nets tx_fifo/full]
set_resistance 2.69833e-05  [get_nets tx_fifo/full]
set_load 1.61327  [get_nets tx_fifo/empty]
set_resistance 2.74258e-05  [get_nets tx_fifo/empty]
set_load 10.2797  [get_nets tx_fifo/rst]
set_resistance 0.00021475  [get_nets tx_fifo/rst]
set_load 3.15684  [get_nets tx_fifo/n75]
set_resistance 6.57334e-05  [get_nets tx_fifo/n75]
set_load 4.74044  [get_nets tx_fifo/n76]
set_resistance 9.19882e-05  [get_nets tx_fifo/n76]
set_load 4.36383  [get_nets tx_fifo/re]
set_resistance 9.11666e-05  [get_nets tx_fifo/re]
set_load 4.46388  [get_nets tx_fifo/n81]
set_resistance 8.91328e-05  [get_nets tx_fifo/n81]
set_load 4.44161  [get_nets tx_fifo/n82]
set_resistance 9.29642e-05  [get_nets tx_fifo/n82]
