###################################################################

# Created by write_sdc on Tue May  6 09:38:05 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports clk]
set_input_delay -clock clk  0.01  [get_ports rst]
set_input_delay -clock clk  0.01  [get_ports phy_tx_mode]
set_input_delay -clock clk  0.01  [get_ports rxd]
set_input_delay -clock clk  0.01  [get_ports rxdp]
set_input_delay -clock clk  0.01  [get_ports rxdn]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {DataOut_i[0]}]
set_input_delay -clock clk  0.01  [get_ports TxValid_i]
set_output_delay -clock clk  0.01  [get_ports usb_rst]
set_output_delay -clock clk  0.01  [get_ports txdp]
set_output_delay -clock clk  0.01  [get_ports txdn]
set_output_delay -clock clk  0.01  [get_ports txoe]
set_output_delay -clock clk  0.01  [get_ports TxReady_o]
set_output_delay -clock clk  0.01  [get_ports RxValid_o]
set_output_delay -clock clk  0.01  [get_ports RxActive_o]
set_output_delay -clock clk  0.01  [get_ports RxError_o]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {DataIn_o[0]}]
set_output_delay -clock clk  0.01  [get_ports {LineState_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {LineState_o[0]}]
set_load 0.252729  [get_nets N11]
set_resistance 6.02592e-06  [get_nets N11]
set_load 1.32674  [get_nets {rst_cnt[4]}]
set_resistance 3.10809e-05  [get_nets {rst_cnt[4]}]
set_load 0.312308  [get_nets -hsc @ {add_178_S2/carry[4]}]
set_resistance 7.44821e-06  [get_nets -hsc @ {add_178_S2/carry[4]}]
set_load 0.746777  [get_nets {rst_cnt[3]}]
set_resistance 1.58402e-05  [get_nets {rst_cnt[3]}]
set_load 0.959279  [get_nets n7]
set_resistance 1.87437e-05  [get_nets n7]
set_load 1.22548  [get_nets {rst_cnt[2]}]
set_resistance 2.72951e-05  [get_nets {rst_cnt[2]}]
set_load 0.592108  [get_nets n17]
set_resistance 1.39542e-05  [get_nets n17]
set_load 0.476283  [get_nets N10]
set_resistance 9.60376e-06  [get_nets N10]
set_load 0.539903  [get_nets -hsc @ {add_178_S2/carry[3]}]
set_resistance 1.22329e-05  [get_nets -hsc @ {add_178_S2/carry[3]}]
set_load 0.294169  [get_nets N9]
set_resistance 7.31636e-06  [get_nets N9]
set_load 0.281338  [get_nets -hsc @ {add_178_S2/carry[2]}]
set_resistance 7.93427e-06  [get_nets -hsc @ {add_178_S2/carry[2]}]
set_load 0.431393  [get_nets N8]
set_resistance 9.25698e-06  [get_nets N8]
set_load 0.613545  [get_nets {rst_cnt[0]}]
set_resistance 1.56205e-05  [get_nets {rst_cnt[0]}]
set_load 1.12045  [get_nets {rst_cnt[1]}]
set_resistance 2.45119e-05  [get_nets {rst_cnt[1]}]
set_load 0.372328  [get_nets n18]
set_resistance 7.91631e-06  [get_nets n18]
set_load 2.29746  [get_nets n4]
set_resistance 4.58783e-05  [get_nets n4]
set_load 0.572366  [get_nets n5]
set_resistance 1.36564e-05  [get_nets n5]
set_load 0.307249  [get_nets n6]
set_resistance 7.06672e-06  [get_nets n6]
set_load 0.757277  [get_nets N7]
set_resistance 1.47489e-05  [get_nets N7]
set_load 0.526676  [get_nets n12]
set_resistance 1.25058e-05  [get_nets n12]
set_load 2.37341  [get_nets n16]
set_resistance 4.81596e-05  [get_nets n16]
set_load 0.680154  [get_nets n11]
set_resistance 1.33552e-05  [get_nets n11]
set_load 0.216421  [get_nets n10]
set_resistance 5.76985e-06  [get_nets n10]
set_load 0.529037  [get_nets n9]
set_resistance 1.08647e-05  [get_nets n9]
set_load 0.221832  [get_nets n8]
set_resistance 5.47586e-06  [get_nets n8]
set_load 5.76442  [get_nets RxError_o]
set_resistance 0.000120323  [get_nets RxError_o]
set_load 5.48678  [get_nets RxActive_o]
set_resistance 0.000115687  [get_nets RxActive_o]
set_load 3.9142  [get_nets RxValid_o]
set_resistance 8.44756e-05  [get_nets RxValid_o]
set_load 1.19591  [get_nets TxReady_o]
set_resistance 2.69971e-05  [get_nets TxReady_o]
set_load 2.34967  [get_nets txoe]
set_resistance 5.35024e-05  [get_nets txoe]
set_load 1.63506  [get_nets txdn]
set_resistance 3.67022e-05  [get_nets txdn]
set_load 2.69224  [get_nets txdp]
set_resistance 5.93203e-05  [get_nets txdp]
set_load 3.6949  [get_nets usb_rst]
set_resistance 8.06103e-05  [get_nets usb_rst]
set_load 4.5186  [get_nets TxValid_i]
set_resistance 9.78229e-05  [get_nets TxValid_i]
set_load 1.3351  [get_nets rxdn]
set_resistance 3.04036e-05  [get_nets rxdn]
set_load 1.09395  [get_nets rxdp]
set_resistance 2.37724e-05  [get_nets rxdp]
set_load 1.42323  [get_nets rxd]
set_resistance 2.92079e-05  [get_nets rxd]
set_load 3.30367  [get_nets phy_tx_mode]
set_resistance 7.17298e-05  [get_nets phy_tx_mode]
set_load 9.50461  [get_nets rst]
set_resistance 0.000197157  [get_nets rst]
set_load 36.66  [get_nets clk]
set_resistance 0.000860813  [get_nets clk]
set_load 4.9855  [get_nets {LineState_o[1]}]
set_resistance 0.000104695  [get_nets {LineState_o[1]}]
set_load 6.29751  [get_nets {LineState_o[0]}]
set_resistance 0.000128045  [get_nets {LineState_o[0]}]
set_load 2.55726  [get_nets {DataIn_o[7]}]
set_resistance 5.77659e-05  [get_nets {DataIn_o[7]}]
set_load 2.02464  [get_nets {DataIn_o[6]}]
set_resistance 4.73898e-05  [get_nets {DataIn_o[6]}]
set_load 1.43209  [get_nets {DataIn_o[5]}]
set_resistance 3.36884e-05  [get_nets {DataIn_o[5]}]
set_load 2.99356  [get_nets {DataIn_o[4]}]
set_resistance 6.08828e-05  [get_nets {DataIn_o[4]}]
set_load 1.92158  [get_nets {DataIn_o[3]}]
set_resistance 4.3819e-05  [get_nets {DataIn_o[3]}]
set_load 2.34425  [get_nets {DataIn_o[2]}]
set_resistance 5.27307e-05  [get_nets {DataIn_o[2]}]
set_load 4.89321  [get_nets {DataIn_o[1]}]
set_resistance 9.62886e-05  [get_nets {DataIn_o[1]}]
set_load 5.43895  [get_nets {DataIn_o[0]}]
set_resistance 0.000118838  [get_nets {DataIn_o[0]}]
set_load 2.20434  [get_nets {DataOut_i[7]}]
set_resistance 4.96726e-05  [get_nets {DataOut_i[7]}]
set_load 2.1242  [get_nets {DataOut_i[6]}]
set_resistance 4.77163e-05  [get_nets {DataOut_i[6]}]
set_load 0.971556  [get_nets {DataOut_i[5]}]
set_resistance 2.19902e-05  [get_nets {DataOut_i[5]}]
set_load 1.17511  [get_nets {DataOut_i[4]}]
set_resistance 2.68592e-05  [get_nets {DataOut_i[4]}]
set_load 1.20169  [get_nets {DataOut_i[3]}]
set_resistance 2.77272e-05  [get_nets {DataOut_i[3]}]
set_load 1.54179  [get_nets {DataOut_i[2]}]
set_resistance 3.41852e-05  [get_nets {DataOut_i[2]}]
set_load 2.17638  [get_nets {DataOut_i[1]}]
set_resistance 4.77993e-05  [get_nets {DataOut_i[1]}]
set_load 3.79538  [get_nets {DataOut_i[0]}]
set_resistance 7.2054e-05  [get_nets {DataOut_i[0]}]
set_load 5.90452  [get_nets fs_ce]
set_resistance 0.000124908  [get_nets fs_ce]
set_load 3.62956  [get_nets n1]
set_resistance 7.34901e-05  [get_nets n1]
set_load 0.647635  [get_nets i_rx_phy/n6]
set_resistance 1.57963e-05  [get_nets i_rx_phy/n6]
set_load 0.640563  [get_nets i_rx_phy/n129]
set_resistance 1.42992e-05  [get_nets i_rx_phy/n129]
set_load 3.94561  [get_nets i_rx_phy/n3]
set_resistance 8.26134e-05  [get_nets i_rx_phy/n3]
set_load 0.277227  [get_nets i_rx_phy/n98]
set_resistance 5.33651e-06  [get_nets i_rx_phy/n98]
set_load 0.428941  [get_nets i_rx_phy/n91]
set_resistance 6.96064e-06  [get_nets i_rx_phy/n91]
set_load 0.194457  [get_nets i_rx_phy/n25]
set_resistance 5.29029e-06  [get_nets i_rx_phy/n25]
set_load 0.893729  [get_nets i_rx_phy/n120]
set_resistance 2.06318e-05  [get_nets i_rx_phy/n120]
set_load 0.287508  [get_nets i_rx_phy/n97]
set_resistance 7.44944e-06  [get_nets i_rx_phy/n97]
set_load 0.242779  [get_nets i_rx_phy/n96]
set_resistance 6.63129e-06  [get_nets i_rx_phy/n96]
set_load 0.260616  [get_nets i_rx_phy/n95]
set_resistance 6.63129e-06  [get_nets i_rx_phy/n95]
set_load 0.206763  [get_nets i_rx_phy/n94]
set_resistance 4.58033e-06  [get_nets i_rx_phy/n94]
set_load 0.269603  [get_nets i_rx_phy/n93]
set_resistance 7.1681e-06  [get_nets i_rx_phy/n93]
set_load 0.3297  [get_nets i_rx_phy/n92]
set_resistance 8.24826e-06  [get_nets i_rx_phy/n92]
set_load 0.250967  [get_nets i_rx_phy/fs_ce_r2]
set_resistance 6.38625e-06  [get_nets i_rx_phy/fs_ce_r2]
set_load 0.630094  [get_nets i_rx_phy/rxdn_s_r]
set_resistance 1.35984e-05  [get_nets i_rx_phy/rxdn_s_r]
set_load 3.17527  [get_nets i_rx_phy/rxdn_s0]
set_resistance 6.39712e-05  [get_nets i_rx_phy/rxdn_s0]
set_load 0.69675  [get_nets i_rx_phy/rxdp_s_r]
set_resistance 1.46038e-05  [get_nets i_rx_phy/rxdp_s_r]
set_load 2.44499  [get_nets i_rx_phy/rxdp_s0]
set_resistance 5.10834e-05  [get_nets i_rx_phy/rxdp_s0]
set_load 0.228227  [get_nets i_rx_phy/fs_ce_r1]
set_resistance 6.09745e-06  [get_nets i_rx_phy/fs_ce_r1]
set_load 0.764912  [get_nets i_rx_phy/n67]
set_resistance 1.78287e-05  [get_nets i_rx_phy/n67]
set_load 0.290429  [get_nets i_rx_phy/n70]
set_resistance 6.79875e-06  [get_nets i_rx_phy/n70]
set_load 0.633112  [get_nets i_rx_phy/N87]
set_resistance 1.40417e-05  [get_nets i_rx_phy/N87]
set_load 0.569268  [get_nets i_rx_phy/n136]
set_resistance 1.14347e-05  [get_nets i_rx_phy/n136]
set_load 2.83313  [get_nets i_rx_phy/n110]
set_resistance 6.03991e-05  [get_nets i_rx_phy/n110]
set_load 0.696212  [get_nets i_rx_phy/n133]
set_resistance 1.50568e-05  [get_nets i_rx_phy/n133]
set_load 0.281727  [get_nets i_rx_phy/n74]
set_resistance 7.64331e-06  [get_nets i_rx_phy/n74]
set_load 0.421519  [get_nets i_rx_phy/rxd_r]
set_resistance 1.01036e-05  [get_nets i_rx_phy/rxd_r]
set_load 0.29123  [get_nets i_rx_phy/n121]
set_resistance 7.43712e-06  [get_nets i_rx_phy/n121]
set_load 0.556324  [get_nets i_rx_phy/n8]
set_resistance 1.13391e-05  [get_nets i_rx_phy/n8]
set_load 0.499909  [get_nets i_rx_phy/n132]
set_resistance 1.15539e-05  [get_nets i_rx_phy/n132]
set_load 0.442273  [get_nets i_rx_phy/n13]
set_resistance 8.51888e-06  [get_nets i_rx_phy/n13]
set_load 0.471136  [get_nets i_rx_phy/n12]
set_resistance 8.93832e-06  [get_nets i_rx_phy/n12]
set_load 0.415278  [get_nets i_rx_phy/n131]
set_resistance 8.52073e-06  [get_nets i_rx_phy/n131]
set_load 0.825357  [get_nets i_rx_phy/sd_r]
set_resistance 1.77001e-05  [get_nets i_rx_phy/sd_r]
set_load 0.355825  [get_nets i_rx_phy/n59]
set_resistance 8.19949e-06  [get_nets i_rx_phy/n59]
set_load 0.965863  [get_nets i_rx_phy/n114]
set_resistance 1.87226e-05  [get_nets i_rx_phy/n114]
set_load 2.34225  [get_nets i_rx_phy/sd_nrzi]
set_resistance 4.60738e-05  [get_nets i_rx_phy/sd_nrzi]
set_load 0.301706  [get_nets i_rx_phy/n58]
set_resistance 5.63025e-06  [get_nets i_rx_phy/n58]
set_load 0.476576  [get_nets i_rx_phy/n134]
set_resistance 1.09596e-05  [get_nets i_rx_phy/n134]
set_load 0.350113  [get_nets i_rx_phy/n20]
set_resistance 7.63358e-06  [get_nets i_rx_phy/n20]
set_load 0.43676  [get_nets i_rx_phy/n62]
set_resistance 9.0649e-06  [get_nets i_rx_phy/n62]
set_load 0.764113  [get_nets i_rx_phy/n135]
set_resistance 1.469e-05  [get_nets i_rx_phy/n135]
set_load 0.57217  [get_nets i_rx_phy/n101]
set_resistance 1.33992e-05  [get_nets i_rx_phy/n101]
set_load 0.336752  [get_nets i_rx_phy/se0_s]
set_resistance 8.82518e-06  [get_nets i_rx_phy/se0_s]
set_load 0.399166  [get_nets i_rx_phy/n100]
set_resistance 9.53319e-06  [get_nets i_rx_phy/n100]
set_load 0.281995  [get_nets i_rx_phy/n44]
set_resistance 7.93049e-06  [get_nets i_rx_phy/n44]
set_load 0.494374  [get_nets i_rx_phy/n43]
set_resistance 1.06243e-05  [get_nets i_rx_phy/n43]
set_load 0.661766  [get_nets i_rx_phy/shift_en]
set_resistance 1.59311e-05  [get_nets i_rx_phy/shift_en]
set_load 0.371896  [get_nets i_rx_phy/n130]
set_resistance 7.53731e-06  [get_nets i_rx_phy/n130]
set_load 0.850263  [get_nets i_rx_phy/n14]
set_resistance 1.92881e-05  [get_nets i_rx_phy/n14]
set_load 0.574987  [get_nets i_rx_phy/n122]
set_resistance 1.38849e-05  [get_nets i_rx_phy/n122]
set_load 0.298395  [get_nets i_rx_phy/n17]
set_resistance 6.41211e-06  [get_nets i_rx_phy/n17]
set_load 1.59819  [get_nets i_rx_phy/n46]
set_resistance 3.10314e-05  [get_nets i_rx_phy/n46]
set_load 0.276944  [get_nets i_rx_phy/n22]
set_resistance 6.45738e-06  [get_nets i_rx_phy/n22]
set_load 0.743934  [get_nets i_rx_phy/rx_valid1]
set_resistance 1.64529e-05  [get_nets i_rx_phy/rx_valid1]
set_load 0.56012  [get_nets i_rx_phy/n16]
set_resistance 1.18582e-05  [get_nets i_rx_phy/n16]
set_load 0.23189  [get_nets i_rx_phy/n123]
set_resistance 5.33651e-06  [get_nets i_rx_phy/n123]
set_load 0.344727  [get_nets i_rx_phy/n11]
set_resistance 6.44649e-06  [get_nets i_rx_phy/n11]
set_load 1.33567  [get_nets i_rx_phy/n49]
set_resistance 2.84139e-05  [get_nets i_rx_phy/n49]
set_load 0.512859  [get_nets i_rx_phy/n54]
set_resistance 1.15777e-05  [get_nets i_rx_phy/n54]
set_load 0.603033  [get_nets i_rx_phy/n51]
set_resistance 1.34144e-05  [get_nets i_rx_phy/n51]
set_load 0.263483  [get_nets i_rx_phy/n35]
set_resistance 4.90913e-06  [get_nets i_rx_phy/n35]
set_load 1.18224  [get_nets i_rx_phy/n56]
set_resistance 2.67434e-05  [get_nets i_rx_phy/n56]
set_load 0.992339  [get_nets i_rx_phy/n7]
set_resistance 2.1478e-05  [get_nets i_rx_phy/n7]
set_load 0.918857  [get_nets i_rx_phy/rx_valid_r]
set_resistance 1.92314e-05  [get_nets i_rx_phy/rx_valid_r]
set_load 2.97539  [get_nets i_rx_phy/rx_en]
set_resistance 6.15335e-05  [get_nets i_rx_phy/rx_en]
set_load 0.533691  [get_nets i_rx_phy/n64]
set_resistance 9.79846e-06  [get_nets i_rx_phy/n64]
set_load 1.22093  [get_nets i_rx_phy/n36]
set_resistance 2.60863e-05  [get_nets i_rx_phy/n36]
set_load 0.717994  [get_nets i_rx_phy/n21]
set_resistance 1.52559e-05  [get_nets i_rx_phy/n21]
set_load 1.86217  [get_nets i_rx_phy/n1]
set_resistance 3.70027e-05  [get_nets i_rx_phy/n1]
set_load 1.07104  [get_nets i_rx_phy/n2]
set_resistance 2.31465e-05  [get_nets i_rx_phy/n2]
set_load 0.369352  [get_nets i_rx_phy/n103]
set_resistance 9.33177e-06  [get_nets i_rx_phy/n103]
set_load 0.316626  [get_nets i_rx_phy/n78]
set_resistance 8.45578e-06  [get_nets i_rx_phy/n78]
set_load 0.283883  [get_nets i_rx_phy/n79]
set_resistance 5.82939e-06  [get_nets i_rx_phy/n79]
set_load 0.759234  [get_nets i_rx_phy/n77]
set_resistance 1.69432e-05  [get_nets i_rx_phy/n77]
set_load 0.885327  [get_nets i_rx_phy/N166]
set_resistance 1.92873e-05  [get_nets i_rx_phy/N166]
set_load 0.914035  [get_nets i_rx_phy/n76]
set_resistance 1.82162e-05  [get_nets i_rx_phy/n76]
set_load 0.732433  [get_nets i_rx_phy/N31]
set_resistance 1.51708e-05  [get_nets i_rx_phy/N31]
set_load 0.570071  [get_nets i_rx_phy/n73]
set_resistance 1.47949e-05  [get_nets i_rx_phy/n73]
set_load 0.674465  [get_nets i_rx_phy/n28]
set_resistance 1.65604e-05  [get_nets i_rx_phy/n28]
set_load 0.24199  [get_nets i_rx_phy/n68]
set_resistance 6.57977e-06  [get_nets i_rx_phy/n68]
set_load 1.84707  [get_nets i_rx_phy/rxd_s]
set_resistance 4.12084e-05  [get_nets i_rx_phy/rxd_s]
set_load 1.2208  [get_nets i_rx_phy/rxd_s0]
set_resistance 2.78906e-05  [get_nets i_rx_phy/rxd_s0]
set_load 0.289726  [get_nets i_rx_phy/rxd_s1]
set_resistance 7.65033e-06  [get_nets i_rx_phy/rxd_s1]
set_load 0.217739  [get_nets i_rx_phy/n137]
set_resistance 5.5894e-06  [get_nets i_rx_phy/n137]
set_load 0.855335  [get_nets i_rx_phy/n48]
set_resistance 1.56683e-05  [get_nets i_rx_phy/n48]
set_load 0.814696  [get_nets i_rx_phy/n53]
set_resistance 1.44707e-05  [get_nets i_rx_phy/n53]
set_load 0.976579  [get_nets i_rx_phy/n113]
set_resistance 2.24729e-05  [get_nets i_rx_phy/n113]
set_load 1.29453  [get_nets i_rx_phy/n42]
set_resistance 2.47022e-05  [get_nets i_rx_phy/n42]
set_load 0.290581  [get_nets i_rx_phy/rxdp_s]
set_resistance 7.25385e-06  [get_nets i_rx_phy/rxdp_s]
set_load 1.69997  [get_nets i_rx_phy/n39]
set_resistance 3.44829e-05  [get_nets i_rx_phy/n39]
set_load 0.54842  [get_nets i_rx_phy/rxdn_s]
set_resistance 1.03498e-05  [get_nets i_rx_phy/rxdn_s]
set_load 1.14509  [get_nets i_rx_phy/n111]
set_resistance 2.25795e-05  [get_nets i_rx_phy/n111]
set_load 0.312678  [get_nets i_rx_phy/n71]
set_resistance 7.69893e-06  [get_nets i_rx_phy/n71]
set_load 0.183796  [get_nets i_rx_phy/n69]
set_resistance 4.75034e-06  [get_nets i_rx_phy/n69]
set_load 0.638043  [get_nets i_rx_phy/n40]
set_resistance 1.57473e-05  [get_nets i_rx_phy/n40]
set_load 0.398295  [get_nets i_rx_phy/n50]
set_resistance 9.32666e-06  [get_nets i_rx_phy/n50]
set_load 1.07836  [get_nets i_rx_phy/n19]
set_resistance 2.48828e-05  [get_nets i_rx_phy/n19]
set_load 0.216223  [get_nets i_rx_phy/n41]
set_resistance 6.29745e-06  [get_nets i_rx_phy/n41]
set_load 3.15614  [get_nets i_rx_phy/n119]
set_resistance 6.65166e-05  [get_nets i_rx_phy/n119]
set_load 1.16409  [get_nets i_rx_phy/n29]
set_resistance 2.55171e-05  [get_nets i_rx_phy/n29]
set_load 1.29186  [get_nets i_rx_phy/n47]
set_resistance 2.79781e-05  [get_nets i_rx_phy/n47]
set_load 1.08723  [get_nets i_rx_phy/n116]
set_resistance 2.41092e-05  [get_nets i_rx_phy/n116]
set_load 0.798289  [get_nets i_rx_phy/n23]
set_resistance 1.64339e-05  [get_nets i_rx_phy/n23]
set_load 0.467302  [get_nets i_rx_phy/n26]
set_resistance 1.09253e-05  [get_nets i_rx_phy/n26]
set_load 0.316265  [get_nets i_rx_phy/n117]
set_resistance 6.30025e-06  [get_nets i_rx_phy/n117]
set_load 1.43291  [get_nets i_rx_phy/n5]
set_resistance 3.15592e-05  [get_nets i_rx_phy/n5]
set_load 0.217273  [get_nets i_rx_phy/n31]
set_resistance 5.13683e-06  [get_nets i_rx_phy/n31]
set_load 0.489436  [get_nets i_rx_phy/n126]
set_resistance 1.17696e-05  [get_nets i_rx_phy/n126]
set_load 1.39435  [get_nets i_rx_phy/n30]
set_resistance 3.08313e-05  [get_nets i_rx_phy/n30]
set_load 1.69083  [get_nets i_rx_phy/n34]
set_resistance 3.74625e-05  [get_nets i_rx_phy/n34]
set_load 0.387487  [get_nets i_rx_phy/n32]
set_resistance 8.92983e-06  [get_nets i_rx_phy/n32]
set_load 0.764254  [get_nets i_rx_phy/n10]
set_resistance 1.5896e-05  [get_nets i_rx_phy/n10]
set_load 0.525373  [get_nets i_rx_phy/n37]
set_resistance 1.24108e-05  [get_nets i_rx_phy/n37]
set_load 1.14182  [get_nets {i_rx_phy/one_cnt[1]}]
set_resistance 2.45951e-05  [get_nets {i_rx_phy/one_cnt[1]}]
set_load 0.218942  [get_nets i_rx_phy/n38]
set_resistance 6.08857e-06  [get_nets i_rx_phy/n38]
set_load 0.882311  [get_nets i_rx_phy/n128]
set_resistance 1.971e-05  [get_nets i_rx_phy/n128]
set_load 1.13951  [get_nets {i_rx_phy/one_cnt[0]}]
set_resistance 2.45247e-05  [get_nets {i_rx_phy/one_cnt[0]}]
set_load 0.560638  [get_nets {i_rx_phy/one_cnt[2]}]
set_resistance 1.17639e-05  [get_nets {i_rx_phy/one_cnt[2]}]
set_load 0.491804  [get_nets i_rx_phy/n127]
set_resistance 1.16929e-05  [get_nets i_rx_phy/n127]
set_load 0.367941  [get_nets i_rx_phy/n33]
set_resistance 7.19307e-06  [get_nets i_rx_phy/n33]
set_load 2.17705  [get_nets i_rx_phy/n15]
set_resistance 4.11177e-05  [get_nets i_rx_phy/n15]
set_load 0.58345  [get_nets i_rx_phy/n124]
set_resistance 1.33992e-05  [get_nets i_rx_phy/n124]
set_load 0.368068  [get_nets i_rx_phy/n9]
set_resistance 1.01246e-05  [get_nets i_rx_phy/n9]
set_load 0.435607  [get_nets i_rx_phy/n24]
set_resistance 8.00024e-06  [get_nets i_rx_phy/n24]
set_load 0.981414  [get_nets i_rx_phy/n4]
set_resistance 2.08627e-05  [get_nets i_rx_phy/n4]
set_load 0.429912  [get_nets i_rx_phy/n27]
set_resistance 9.52216e-06  [get_nets i_rx_phy/n27]
set_load 0.554544  [get_nets i_rx_phy/n125]
set_resistance 1.25962e-05  [get_nets i_rx_phy/n125]
set_load 0.436672  [get_nets i_rx_phy/n115]
set_resistance 1.02563e-05  [get_nets i_rx_phy/n115]
set_load 1.33643  [get_nets i_rx_phy/n75]
set_resistance 2.71224e-05  [get_nets i_rx_phy/n75]
set_load 0.280124  [get_nets i_rx_phy/n18]
set_resistance 6.44353e-06  [get_nets i_rx_phy/n18]
set_load 0.239252  [get_nets i_rx_phy/n52]
set_resistance 5.01604e-06  [get_nets i_rx_phy/n52]
set_load 1.40019  [get_nets i_rx_phy/n112]
set_resistance 2.79627e-05  [get_nets i_rx_phy/n112]
set_load 5.43895  [get_nets {i_rx_phy/DataIn_o[0]}]
set_resistance 0.000118838  [get_nets {i_rx_phy/DataIn_o[0]}]
set_load 4.89321  [get_nets {i_rx_phy/DataIn_o[1]}]
set_resistance 9.62886e-05  [get_nets {i_rx_phy/DataIn_o[1]}]
set_load 2.34425  [get_nets {i_rx_phy/DataIn_o[2]}]
set_resistance 5.27307e-05  [get_nets {i_rx_phy/DataIn_o[2]}]
set_load 1.92158  [get_nets {i_rx_phy/DataIn_o[3]}]
set_resistance 4.3819e-05  [get_nets {i_rx_phy/DataIn_o[3]}]
set_load 2.99356  [get_nets {i_rx_phy/DataIn_o[4]}]
set_resistance 6.08828e-05  [get_nets {i_rx_phy/DataIn_o[4]}]
set_load 1.43209  [get_nets {i_rx_phy/DataIn_o[5]}]
set_resistance 3.36884e-05  [get_nets {i_rx_phy/DataIn_o[5]}]
set_load 2.02464  [get_nets {i_rx_phy/DataIn_o[6]}]
set_resistance 4.73898e-05  [get_nets {i_rx_phy/DataIn_o[6]}]
set_load 2.55726  [get_nets {i_rx_phy/DataIn_o[7]}]
set_resistance 5.77659e-05  [get_nets {i_rx_phy/DataIn_o[7]}]
set_load 6.29751  [get_nets {i_rx_phy/LineState[0]}]
set_resistance 0.000128045  [get_nets {i_rx_phy/LineState[0]}]
set_load 4.9855  [get_nets {i_rx_phy/LineState[1]}]
set_resistance 0.000104695  [get_nets {i_rx_phy/LineState[1]}]
set_load 36.66  [get_nets i_rx_phy/clk]
set_resistance 0.000860813  [get_nets i_rx_phy/clk]
set_load 1.42323  [get_nets i_rx_phy/rxd]
set_resistance 2.92079e-05  [get_nets i_rx_phy/rxd]
set_load 1.09395  [get_nets i_rx_phy/rxdp]
set_resistance 2.37724e-05  [get_nets i_rx_phy/rxdp]
set_load 1.3351  [get_nets i_rx_phy/rxdn]
set_resistance 3.04036e-05  [get_nets i_rx_phy/rxdn]
set_load 2.34967  [get_nets i_rx_phy/RxEn_i]
set_resistance 5.35024e-05  [get_nets i_rx_phy/RxEn_i]
set_load 5.90452  [get_nets i_rx_phy/fs_ce]
set_resistance 0.000124908  [get_nets i_rx_phy/fs_ce]
set_load 3.9142  [get_nets i_rx_phy/RxValid_o]
set_resistance 8.44756e-05  [get_nets i_rx_phy/RxValid_o]
set_load 5.48678  [get_nets i_rx_phy/RxActive_o]
set_resistance 0.000115687  [get_nets i_rx_phy/RxActive_o]
set_load 5.76442  [get_nets i_rx_phy/RxError_o]
set_resistance 0.000120323  [get_nets i_rx_phy/RxError_o]
set_load 9.50461  [get_nets i_rx_phy/IN0]
set_resistance 0.000197157  [get_nets i_rx_phy/IN0]
set_load 3.62956  [get_nets i_rx_phy/rst]
set_resistance 7.34901e-05  [get_nets i_rx_phy/rst]
set_load 2.39887  [get_nets i_rx_phy/n57]
set_resistance 5.66751e-05  [get_nets i_rx_phy/n57]
set_load 0.57542  [get_nets i_tx_phy/n91]
set_resistance 1.22867e-05  [get_nets i_tx_phy/n91]
set_load 0.441457  [get_nets i_tx_phy/n86]
set_resistance 9.33097e-06  [get_nets i_tx_phy/n86]
set_load 0.312398  [get_nets i_tx_phy/n4]
set_resistance 7.36463e-06  [get_nets i_tx_phy/n4]
set_load 0.518917  [get_nets i_tx_phy/n46]
set_resistance 1.2225e-05  [get_nets i_tx_phy/n46]
set_load 0.540759  [get_nets i_tx_phy/n2]
set_resistance 1.30795e-05  [get_nets i_tx_phy/n2]
set_load 0.651454  [get_nets i_tx_phy/n107]
set_resistance 1.32417e-05  [get_nets i_tx_phy/n107]
set_load 0.463731  [get_nets i_tx_phy/n31]
set_resistance 1.17515e-05  [get_nets i_tx_phy/n31]
set_load 0.242318  [get_nets i_tx_phy/n62]
set_resistance 5.16591e-06  [get_nets i_tx_phy/n62]
set_load 0.637125  [get_nets i_tx_phy/n106]
set_resistance 1.4137e-05  [get_nets i_tx_phy/n106]
set_load 0.255192  [get_nets i_tx_phy/n105]
set_resistance 6.63129e-06  [get_nets i_tx_phy/n105]
set_load 0.618928  [get_nets i_tx_phy/append_eop_sync1]
set_resistance 1.24085e-05  [get_nets i_tx_phy/append_eop_sync1]
set_load 0.286694  [get_nets i_tx_phy/n110]
set_resistance 7.1681e-06  [get_nets i_tx_phy/n110]
set_load 0.252679  [get_nets i_tx_phy/n108]
set_resistance 5.96944e-06  [get_nets i_tx_phy/n108]
set_load 0.498816  [get_nets i_tx_phy/append_eop_sync4]
set_resistance 1.11655e-05  [get_nets i_tx_phy/append_eop_sync4]
set_load 0.416972  [get_nets i_tx_phy/n33]
set_resistance 8.30444e-06  [get_nets i_tx_phy/n33]
set_load 2.38062  [get_nets i_tx_phy/sd_nrzi_o]
set_resistance 4.89309e-05  [get_nets i_tx_phy/sd_nrzi_o]
set_load 0.665823  [get_nets i_tx_phy/n32]
set_resistance 1.38152e-05  [get_nets i_tx_phy/n32]
set_load 0.265218  [get_nets i_tx_phy/n84]
set_resistance 6.49813e-06  [get_nets i_tx_phy/n84]
set_load 0.712667  [get_nets i_tx_phy/n103]
set_resistance 1.25962e-05  [get_nets i_tx_phy/n103]
set_load 0.867486  [get_nets i_tx_phy/txoe_r2]
set_resistance 1.68814e-05  [get_nets i_tx_phy/txoe_r2]
set_load 0.663011  [get_nets i_tx_phy/n112]
set_resistance 1.44083e-05  [get_nets i_tx_phy/n112]
set_load 0.453955  [get_nets i_tx_phy/n10]
set_resistance 9.86344e-06  [get_nets i_tx_phy/n10]
set_load 0.511893  [get_nets i_tx_phy/n111]
set_resistance 1.09683e-05  [get_nets i_tx_phy/n111]
set_load 0.483174  [get_nets i_tx_phy/n104]
set_resistance 1.09175e-05  [get_nets i_tx_phy/n104]
set_load 0.277862  [get_nets i_tx_phy/n30]
set_resistance 6.66623e-06  [get_nets i_tx_phy/n30]
set_load 0.627173  [get_nets i_tx_phy/n83]
set_resistance 1.3545e-05  [get_nets i_tx_phy/n83]
set_load 0.751366  [get_nets i_tx_phy/tx_ready_d]
set_resistance 1.49666e-05  [get_nets i_tx_phy/tx_ready_d]
set_load 0.588135  [get_nets i_tx_phy/N18]
set_resistance 1.31262e-05  [get_nets i_tx_phy/N18]
set_load 0.318898  [get_nets i_tx_phy/n34]
set_resistance 6.76344e-06  [get_nets i_tx_phy/n34]
set_load 0.200528  [get_nets i_tx_phy/n9]
set_resistance 5.75798e-06  [get_nets i_tx_phy/n9]
set_load 0.373438  [get_nets i_tx_phy/n35]
set_resistance 8.73459e-06  [get_nets i_tx_phy/n35]
set_load 0.501023  [get_nets i_tx_phy/n85]
set_resistance 1.14426e-05  [get_nets i_tx_phy/n85]
set_load 0.278095  [get_nets i_tx_phy/n6]
set_resistance 6.89694e-06  [get_nets i_tx_phy/n6]
set_load 0.493152  [get_nets i_tx_phy/n90]
set_resistance 1.25962e-05  [get_nets i_tx_phy/n90]
set_load 1.6505  [get_nets i_tx_phy/n22]
set_resistance 3.65987e-05  [get_nets i_tx_phy/n22]
set_load 0.377215  [get_nets i_tx_phy/n88]
set_resistance 9.25343e-06  [get_nets i_tx_phy/n88]
set_load 0.946568  [get_nets i_tx_phy/n44]
set_resistance 2.07082e-05  [get_nets i_tx_phy/n44]
set_load 0.554208  [get_nets i_tx_phy/n43]
set_resistance 1.36551e-05  [get_nets i_tx_phy/n43]
set_load 0.691114  [get_nets i_tx_phy/n89]
set_resistance 1.41506e-05  [get_nets i_tx_phy/n89]
set_load 0.337849  [get_nets i_tx_phy/n40]
set_resistance 7.75279e-06  [get_nets i_tx_phy/n40]
set_load 0.396905  [get_nets i_tx_phy/n41]
set_resistance 6.85308e-06  [get_nets i_tx_phy/n41]
set_load 0.500385  [get_nets i_tx_phy/n87]
set_resistance 1.22075e-05  [get_nets i_tx_phy/n87]
set_load 0.238771  [get_nets i_tx_phy/n51]
set_resistance 5.89602e-06  [get_nets i_tx_phy/n51]
set_load 0.938803  [get_nets {i_tx_phy/hold_reg[4]}]
set_resistance 2.0846e-05  [get_nets {i_tx_phy/hold_reg[4]}]
set_load 0.167782  [get_nets i_tx_phy/n96]
set_resistance 4.57906e-06  [get_nets i_tx_phy/n96]
set_load 0.506886  [get_nets {i_tx_phy/hold_reg[3]}]
set_resistance 1.30343e-05  [get_nets {i_tx_phy/hold_reg[3]}]
set_load 0.409308  [get_nets i_tx_phy/n97]
set_resistance 1.06109e-05  [get_nets i_tx_phy/n97]
set_load 1.23849  [get_nets {i_tx_phy/hold_reg[2]}]
set_resistance 2.81089e-05  [get_nets {i_tx_phy/hold_reg[2]}]
set_load 0.301443  [get_nets i_tx_phy/n98]
set_resistance 7.7144e-06  [get_nets i_tx_phy/n98]
set_load 1.00844  [get_nets {i_tx_phy/hold_reg[1]}]
set_resistance 2.2004e-05  [get_nets {i_tx_phy/hold_reg[1]}]
set_load 0.34902  [get_nets i_tx_phy/n99]
set_resistance 8.07454e-06  [get_nets i_tx_phy/n99]
set_load 0.797576  [get_nets {i_tx_phy/hold_reg[0]}]
set_resistance 1.89973e-05  [get_nets {i_tx_phy/hold_reg[0]}]
set_load 0.368382  [get_nets i_tx_phy/n100]
set_resistance 7.66358e-06  [get_nets i_tx_phy/n100]
set_load 0.194331  [get_nets i_tx_phy/n28]
set_resistance 5.76312e-06  [get_nets i_tx_phy/n28]
set_load 0.521907  [get_nets {i_tx_phy/hold_reg[7]}]
set_resistance 1.38482e-05  [get_nets {i_tx_phy/hold_reg[7]}]
set_load 0.191694  [get_nets i_tx_phy/n93]
set_resistance 4.9313e-06  [get_nets i_tx_phy/n93]
set_load 0.353305  [get_nets i_tx_phy/n20]
set_resistance 7.94033e-06  [get_nets i_tx_phy/n20]
set_load 0.240551  [get_nets i_tx_phy/n73]
set_resistance 5.76132e-06  [get_nets i_tx_phy/n73]
set_load 0.680822  [get_nets {i_tx_phy/state[2]}]
set_resistance 1.3619e-05  [get_nets {i_tx_phy/state[2]}]
set_load 0.753781  [get_nets i_tx_phy/n71]
set_resistance 1.53159e-05  [get_nets i_tx_phy/n71]
set_load 0.373323  [get_nets i_tx_phy/n70]
set_resistance 7.64331e-06  [get_nets i_tx_phy/n70]
set_load 0.272531  [get_nets i_tx_phy/n69]
set_resistance 6.56618e-06  [get_nets i_tx_phy/n69]
set_load 0.438067  [get_nets i_tx_phy/n37]
set_resistance 8.5059e-06  [get_nets i_tx_phy/n37]
set_load 0.660038  [get_nets i_tx_phy/sd_bs_o]
set_resistance 1.5601e-05  [get_nets i_tx_phy/sd_bs_o]
set_load 0.338143  [get_nets i_tx_phy/n36]
set_resistance 8.28139e-06  [get_nets i_tx_phy/n36]
set_load 1.00246  [get_nets i_tx_phy/n38]
set_resistance 2.37419e-05  [get_nets i_tx_phy/n38]
set_load 1.96835  [get_nets i_tx_phy/txoe_r1]
set_resistance 4.22209e-05  [get_nets i_tx_phy/txoe_r1]
set_load 1.34443  [get_nets i_tx_phy/tx_ip_sync]
set_resistance 2.97928e-05  [get_nets i_tx_phy/tx_ip_sync]
set_load 0.566741  [get_nets i_tx_phy/n58]
set_resistance 1.2288e-05  [get_nets i_tx_phy/n58]
set_load 0.314878  [get_nets i_tx_phy/n68]
set_resistance 7.92639e-06  [get_nets i_tx_phy/n68]
set_load 0.419207  [get_nets i_tx_phy/n57]
set_resistance 9.61713e-06  [get_nets i_tx_phy/n57]
set_load 0.142732  [get_nets i_tx_phy/n101]
set_resistance 4.62413e-06  [get_nets i_tx_phy/n101]
set_load 0.950102  [get_nets i_tx_phy/n61]
set_resistance 1.93587e-05  [get_nets i_tx_phy/n61]
set_load 0.81601  [get_nets i_tx_phy/n63]
set_resistance 1.96731e-05  [get_nets i_tx_phy/n63]
set_load 1.13216  [get_nets i_tx_phy/n64]
set_resistance 2.25573e-05  [get_nets i_tx_phy/n64]
set_load 0.958279  [get_nets i_tx_phy/n24]
set_resistance 1.8822e-05  [get_nets i_tx_phy/n24]
set_load 1.07731  [get_nets i_tx_phy/n23]
set_resistance 2.34752e-05  [get_nets i_tx_phy/n23]
set_load 1.23782  [get_nets {i_tx_phy/state[0]}]
set_resistance 2.75195e-05  [get_nets {i_tx_phy/state[0]}]
set_load 1.33153  [get_nets i_tx_phy/n45]
set_resistance 2.9329e-05  [get_nets i_tx_phy/n45]
set_load 0.791556  [get_nets {i_tx_phy/bit_cnt[0]}]
set_resistance 1.96775e-05  [get_nets {i_tx_phy/bit_cnt[0]}]
set_load 1.31607  [get_nets i_tx_phy/n12]
set_resistance 2.65672e-05  [get_nets i_tx_phy/n12]
set_load 1.045  [get_nets i_tx_phy/n5]
set_resistance 2.24752e-05  [get_nets i_tx_phy/n5]
set_load 1.59999  [get_nets {i_tx_phy/bit_cnt[1]}]
set_resistance 3.35632e-05  [get_nets {i_tx_phy/bit_cnt[1]}]
set_load 0.391631  [get_nets {i_tx_phy/hold_reg_d[4]}]
set_resistance 9.53637e-06  [get_nets {i_tx_phy/hold_reg_d[4]}]
set_load 0.895874  [get_nets i_tx_phy/n81]
set_resistance 1.80629e-05  [get_nets i_tx_phy/n81]
set_load 0.219452  [get_nets {i_tx_phy/hold_reg_d[6]}]
set_resistance 6.03783e-06  [get_nets {i_tx_phy/hold_reg_d[6]}]
set_load 2.07079  [get_nets i_tx_phy/n42]
set_resistance 4.50008e-05  [get_nets i_tx_phy/n42]
set_load 0.628878  [get_nets {i_tx_phy/hold_reg_d[0]}]
set_resistance 1.42762e-05  [get_nets {i_tx_phy/hold_reg_d[0]}]
set_load 0.390004  [get_nets i_tx_phy/n80]
set_resistance 9.06274e-06  [get_nets i_tx_phy/n80]
set_load 0.490541  [get_nets {i_tx_phy/hold_reg_d[2]}]
set_resistance 1.0909e-05  [get_nets {i_tx_phy/hold_reg_d[2]}]
set_load 0.285776  [get_nets {i_tx_phy/hold_reg_d[5]}]
set_resistance 6.56001e-06  [get_nets {i_tx_phy/hold_reg_d[5]}]
set_load 0.718073  [get_nets {i_tx_phy/hold_reg_d[7]}]
set_resistance 1.5501e-05  [get_nets {i_tx_phy/hold_reg_d[7]}]
set_load 0.288878  [get_nets i_tx_phy/n78]
set_resistance 6.90986e-06  [get_nets i_tx_phy/n78]
set_load 1.907  [get_nets i_tx_phy/n13]
set_resistance 4.13115e-05  [get_nets i_tx_phy/n13]
set_load 0.572609  [get_nets {i_tx_phy/hold_reg_d[1]}]
set_resistance 1.38689e-05  [get_nets {i_tx_phy/hold_reg_d[1]}]
set_load 0.53473  [get_nets {i_tx_phy/hold_reg_d[3]}]
set_resistance 1.25079e-05  [get_nets {i_tx_phy/hold_reg_d[3]}]
set_load 0.916762  [get_nets i_tx_phy/n79]
set_resistance 1.90227e-05  [get_nets i_tx_phy/n79]
set_load 0.863929  [get_nets i_tx_phy/n77]
set_resistance 1.60447e-05  [get_nets i_tx_phy/n77]
set_load 0.653651  [get_nets i_tx_phy/n11]
set_resistance 1.34296e-05  [get_nets i_tx_phy/n11]
set_load 0.958637  [get_nets {i_tx_phy/bit_cnt[2]}]
set_resistance 2.13613e-05  [get_nets {i_tx_phy/bit_cnt[2]}]
set_load 1.28687  [get_nets i_tx_phy/N88]
set_resistance 2.79073e-05  [get_nets i_tx_phy/N88]
set_load 0.345728  [get_nets i_tx_phy/n75]
set_resistance 7.92639e-06  [get_nets i_tx_phy/n75]
set_load 0.366865  [get_nets i_tx_phy/n72]
set_resistance 6.96753e-06  [get_nets i_tx_phy/n72]
set_load 0.182966  [get_nets i_tx_phy/n74]
set_resistance 4.96644e-06  [get_nets i_tx_phy/n74]
set_load 2.59471  [get_nets i_tx_phy/n56]
set_resistance 5.68085e-05  [get_nets i_tx_phy/n56]
set_load 0.544058  [get_nets i_tx_phy/ld_data]
set_resistance 1.27702e-05  [get_nets i_tx_phy/ld_data]
set_load 0.897428  [get_nets i_tx_phy/n54]
set_resistance 2.07816e-05  [get_nets i_tx_phy/n54]
set_load 0.728389  [get_nets {i_tx_phy/hold_reg[6]}]
set_resistance 1.62448e-05  [get_nets {i_tx_phy/hold_reg[6]}]
set_load 0.456786  [get_nets i_tx_phy/n94]
set_resistance 1.09683e-05  [get_nets i_tx_phy/n94]
set_load 3.05848  [get_nets i_tx_phy/n55]
set_resistance 6.48064e-05  [get_nets i_tx_phy/n55]
set_load 0.621028  [get_nets {i_tx_phy/hold_reg[5]}]
set_resistance 1.5775e-05  [get_nets {i_tx_phy/hold_reg[5]}]
set_load 0.44049  [get_nets i_tx_phy/n95]
set_resistance 1.09579e-05  [get_nets i_tx_phy/n95]
set_load 1.52337  [get_nets i_tx_phy/n26]
set_resistance 3.31579e-05  [get_nets i_tx_phy/n26]
set_load 1.80023  [get_nets i_tx_phy/n39]
set_resistance 3.91914e-05  [get_nets i_tx_phy/n39]
set_load 0.870549  [get_nets i_tx_phy/n47]
set_resistance 1.79085e-05  [get_nets i_tx_phy/n47]
set_load 0.356298  [get_nets i_tx_phy/sd_raw_o]
set_resistance 8.72739e-06  [get_nets i_tx_phy/sd_raw_o]
set_load 0.992332  [get_nets i_tx_phy/n50]
set_resistance 2.08942e-05  [get_nets i_tx_phy/n50]
set_load 0.910185  [get_nets i_tx_phy/n17]
set_resistance 1.8573e-05  [get_nets i_tx_phy/n17]
set_load 0.561743  [get_nets i_tx_phy/n52]
set_resistance 1.25416e-05  [get_nets i_tx_phy/n52]
set_load 0.508355  [get_nets i_tx_phy/n49]
set_resistance 1.0875e-05  [get_nets i_tx_phy/n49]
set_load 0.863909  [get_nets {i_tx_phy/one_cnt[0]}]
set_resistance 1.80196e-05  [get_nets {i_tx_phy/one_cnt[0]}]
set_load 0.929826  [get_nets {i_tx_phy/one_cnt[1]}]
set_resistance 1.98573e-05  [get_nets {i_tx_phy/one_cnt[1]}]
set_load 0.514631  [get_nets i_tx_phy/n15]
set_resistance 1.22461e-05  [get_nets i_tx_phy/n15]
set_load 0.314543  [get_nets i_tx_phy/n48]
set_resistance 7.99022e-06  [get_nets i_tx_phy/n48]
set_load 0.641516  [get_nets i_tx_phy/n16]
set_resistance 1.45258e-05  [get_nets i_tx_phy/n16]
set_load 0.321307  [get_nets i_tx_phy/n59]
set_resistance 7.99022e-06  [get_nets i_tx_phy/n59]
set_load 0.669645  [get_nets i_tx_phy/n102]
set_resistance 1.46913e-05  [get_nets i_tx_phy/n102]
set_load 2.99933  [get_nets i_tx_phy/append_eop_sync3]
set_resistance 6.21917e-05  [get_nets i_tx_phy/append_eop_sync3]
set_load 0.458292  [get_nets i_tx_phy/n109]
set_resistance 1.15109e-05  [get_nets i_tx_phy/n109]
set_load 0.197643  [get_nets i_tx_phy/n65]
set_resistance 4.99965e-06  [get_nets i_tx_phy/n65]
set_load 0.802898  [get_nets i_tx_phy/append_eop_sync2]
set_resistance 1.83001e-05  [get_nets i_tx_phy/append_eop_sync2]
set_load 0.470001  [get_nets i_tx_phy/n92]
set_resistance 1.11718e-05  [get_nets i_tx_phy/n92]
set_load 0.530996  [get_nets i_tx_phy/n67]
set_resistance 9.99601e-06  [get_nets i_tx_phy/n67]
set_load 0.379874  [get_nets i_tx_phy/append_eop]
set_resistance 1.05596e-05  [get_nets i_tx_phy/append_eop]
set_load 0.436471  [get_nets i_tx_phy/n18]
set_resistance 1.09175e-05  [get_nets i_tx_phy/n18]
set_load 0.391792  [get_nets i_tx_phy/n60]
set_resistance 9.06045e-06  [get_nets i_tx_phy/n60]
set_load 0.965885  [get_nets i_tx_phy/tx_ip]
set_resistance 2.17734e-05  [get_nets i_tx_phy/tx_ip]
set_load 1.45723  [get_nets i_tx_phy/n19]
set_resistance 2.92186e-05  [get_nets i_tx_phy/n19]
set_load 0.692269  [get_nets i_tx_phy/n114]
set_resistance 1.55103e-05  [get_nets i_tx_phy/n114]
set_load 0.716815  [get_nets i_tx_phy/n14]
set_resistance 1.63235e-05  [get_nets i_tx_phy/n14]
set_load 0.735657  [get_nets i_tx_phy/sft_done]
set_resistance 1.6123e-05  [get_nets i_tx_phy/sft_done]
set_load 1.33939  [get_nets i_tx_phy/n76]
set_resistance 2.79605e-05  [get_nets i_tx_phy/n76]
set_load 1.12362  [get_nets i_tx_phy/n82]
set_resistance 2.31304e-05  [get_nets i_tx_phy/n82]
set_load 1.09859  [get_nets i_tx_phy/data_done]
set_resistance 2.47687e-05  [get_nets i_tx_phy/data_done]
set_load 1.89527  [get_nets i_tx_phy/n25]
set_resistance 4.02972e-05  [get_nets i_tx_phy/n25]
set_load 1.79335  [get_nets {i_tx_phy/state[1]}]
set_resistance 3.7588e-05  [get_nets {i_tx_phy/state[1]}]
set_load 0.916282  [get_nets {i_tx_phy/one_cnt[2]}]
set_resistance 2.00369e-05  [get_nets {i_tx_phy/one_cnt[2]}]
set_load 0.90791  [get_nets i_tx_phy/n66]
set_resistance 2.18797e-05  [get_nets i_tx_phy/n66]
set_load 0.733378  [get_nets i_tx_phy/n53]
set_resistance 1.61572e-05  [get_nets i_tx_phy/n53]
set_load 3.79538  [get_nets {i_tx_phy/DataOut_i[0]}]
set_resistance 7.2054e-05  [get_nets {i_tx_phy/DataOut_i[0]}]
set_load 2.17638  [get_nets {i_tx_phy/DataOut_i[1]}]
set_resistance 4.77993e-05  [get_nets {i_tx_phy/DataOut_i[1]}]
set_load 1.54179  [get_nets {i_tx_phy/DataOut_i[2]}]
set_resistance 3.41852e-05  [get_nets {i_tx_phy/DataOut_i[2]}]
set_load 1.20169  [get_nets {i_tx_phy/DataOut_i[3]}]
set_resistance 2.77272e-05  [get_nets {i_tx_phy/DataOut_i[3]}]
set_load 1.17511  [get_nets {i_tx_phy/DataOut_i[4]}]
set_resistance 2.68592e-05  [get_nets {i_tx_phy/DataOut_i[4]}]
set_load 0.971556  [get_nets {i_tx_phy/DataOut_i[5]}]
set_resistance 2.19902e-05  [get_nets {i_tx_phy/DataOut_i[5]}]
set_load 2.1242  [get_nets {i_tx_phy/DataOut_i[6]}]
set_resistance 4.77163e-05  [get_nets {i_tx_phy/DataOut_i[6]}]
set_load 2.20434  [get_nets {i_tx_phy/DataOut_i[7]}]
set_resistance 4.96726e-05  [get_nets {i_tx_phy/DataOut_i[7]}]
set_load 36.66  [get_nets i_tx_phy/clk]
set_resistance 0.000860813  [get_nets i_tx_phy/clk]
set_load 5.90452  [get_nets i_tx_phy/fs_ce]
set_resistance 0.000124908  [get_nets i_tx_phy/fs_ce]
set_load 3.30367  [get_nets i_tx_phy/phy_mode]
set_resistance 7.17298e-05  [get_nets i_tx_phy/phy_mode]
set_load 4.5186  [get_nets i_tx_phy/TxValid_i]
set_resistance 9.78229e-05  [get_nets i_tx_phy/TxValid_i]
set_load 2.69224  [get_nets i_tx_phy/txdp]
set_resistance 5.93203e-05  [get_nets i_tx_phy/txdp]
set_load 1.63506  [get_nets i_tx_phy/txdn]
set_resistance 3.67022e-05  [get_nets i_tx_phy/txdn]
set_load 2.34967  [get_nets i_tx_phy/txoe]
set_resistance 5.35024e-05  [get_nets i_tx_phy/txoe]
set_load 1.19591  [get_nets i_tx_phy/TxReady_o]
set_resistance 2.69971e-05  [get_nets i_tx_phy/TxReady_o]
set_load 9.50461  [get_nets i_tx_phy/IN0]
set_resistance 0.000197157  [get_nets i_tx_phy/IN0]
set_load 3.62956  [get_nets i_tx_phy/rst]
set_resistance 7.34901e-05  [get_nets i_tx_phy/rst]
set_load 1.18957  [get_nets i_tx_phy/n7]
set_resistance 2.4557e-05  [get_nets i_tx_phy/n7]
set_load 3.08774  [get_nets i_tx_phy/n8]
set_resistance 6.44792e-05  [get_nets i_tx_phy/n8]
set_load 3.15782  [get_nets i_tx_phy/n21]
set_resistance 6.91146e-05  [get_nets i_tx_phy/n21]
set_load 4.21466  [get_nets i_tx_phy/n27]
set_resistance 8.56325e-05  [get_nets i_tx_phy/n27]
