###################################################################

# Created by write_sdc on Tue Apr 15 10:30:58 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports wb_clk_i]  -name clk  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports wb_clk_i]
set_input_delay -clock clk  0.01  [get_ports wb_rst_i]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[0]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[31]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[30]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[29]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[28]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[27]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[26]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[25]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[24]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[23]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[22]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[21]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[20]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[19]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[18]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[17]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[16]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[15]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[14]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[13]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[12]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[0]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[0]}]
set_input_delay -clock clk  0.01  [get_ports wb_we_i]
set_input_delay -clock clk  0.01  [get_ports wb_stb_i]
set_input_delay -clock clk  0.01  [get_ports wb_cyc_i]
set_input_delay -clock clk  0.01  [get_ports miso_pad_i]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[31]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[30]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[29]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[28]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[27]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[26]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[25]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[24]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[23]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[22]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[21]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[20]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[19]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[18]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[17]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[16]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[15]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[14]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[13]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[12]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[11]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[10]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[9]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[8]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[0]}]
set_output_delay -clock clk  0.01  [get_ports wb_ack_o]
set_output_delay -clock clk  0.01  [get_ports wb_err_o]
set_output_delay -clock clk  0.01  [get_ports wb_int_o]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {ss_pad_o[0]}]
set_output_delay -clock clk  0.01  [get_ports sclk_pad_o]
set_output_delay -clock clk  0.01  [get_ports mosi_pad_o]
