###################################################################

# Created by write_sdc on Tue May 13 10:42:27 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports clk]
set_input_delay -clock clk  0.01  [get_ports reset]
set_input_delay -clock clk  0.01  [get_ports load_i]
set_input_delay -clock clk  0.01  [get_ports decrypt_i]
set_input_delay -clock clk  0.01  [get_ports {data_i[127]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[126]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[125]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[124]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[123]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[122]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[121]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[120]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[119]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[118]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[117]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[116]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[115]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[114]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[113]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[112]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[111]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[110]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[109]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[108]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[107]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[106]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[105]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[104]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[103]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[102]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[101]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[100]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[99]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[98]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[97]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[96]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[95]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[94]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[93]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[92]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[91]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[90]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[89]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[88]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[87]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[86]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[85]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[84]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[83]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[82]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[81]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[80]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[79]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[78]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[77]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[76]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[75]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[74]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[73]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[72]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[71]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[70]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[69]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[68]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[67]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[66]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[65]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[64]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[63]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[62]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[61]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[60]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[59]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[58]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[57]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[56]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[55]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[54]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[53]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[52]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[51]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[50]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[49]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[48]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[47]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[46]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[45]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[44]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[43]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[42]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[41]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[40]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[39]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[38]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[37]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[36]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[35]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[34]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[33]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[32]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[31]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[30]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[29]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[28]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[27]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[26]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[25]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[24]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[23]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[22]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[21]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[20]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[19]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[18]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[17]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[16]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[15]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[14]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[13]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[12]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {data_i[0]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[127]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[126]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[125]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[124]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[123]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[122]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[121]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[120]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[119]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[118]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[117]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[116]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[115]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[114]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[113]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[112]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[111]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[110]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[109]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[108]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[107]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[106]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[105]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[104]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[103]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[102]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[101]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[100]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[99]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[98]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[97]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[96]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[95]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[94]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[93]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[92]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[91]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[90]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[89]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[88]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[87]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[86]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[85]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[84]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[83]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[82]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[81]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[80]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[79]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[78]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[77]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[76]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[75]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[74]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[73]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[72]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[71]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[70]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[69]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[68]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[67]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[66]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[65]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[64]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[63]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[62]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[61]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[60]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[59]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[58]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[57]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[56]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[55]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[54]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[53]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[52]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[51]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[50]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[49]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[48]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[47]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[46]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[45]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[44]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[43]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[42]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[41]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[40]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[39]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[38]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[37]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[36]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[35]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[34]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[33]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[32]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[31]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[30]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[29]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[28]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[27]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[26]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[25]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[24]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[23]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[22]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[21]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[20]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[19]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[18]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[17]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[16]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[15]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[14]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[13]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[12]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {key_i[0]}]
set_output_delay -clock clk  0.01  [get_ports ready_o]
set_output_delay -clock clk  0.01  [get_ports {data_o[127]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[126]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[125]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[124]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[123]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[122]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[121]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[120]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[119]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[118]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[117]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[116]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[115]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[114]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[113]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[112]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[111]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[110]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[109]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[108]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[107]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[106]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[105]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[104]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[103]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[102]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[101]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[100]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[99]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[98]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[97]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[96]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[95]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[94]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[93]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[92]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[91]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[90]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[89]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[88]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[87]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[86]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[85]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[84]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[83]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[82]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[81]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[80]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[79]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[78]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[77]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[76]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[75]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[74]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[73]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[72]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[71]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[70]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[69]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[68]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[67]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[66]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[65]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[64]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[63]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[62]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[61]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[60]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[59]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[58]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[57]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[56]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[55]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[54]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[53]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[52]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[51]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[50]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[49]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[48]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[47]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[46]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[45]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[44]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[43]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[42]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[41]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[40]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[39]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[38]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[37]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[36]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[35]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[34]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[33]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[32]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[31]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[30]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[29]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[28]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[27]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[26]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[25]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[24]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[23]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[22]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[21]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[20]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[19]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[18]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[17]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[16]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[15]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[14]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[13]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[12]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[11]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[10]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[9]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[8]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {data_o[0]}]
