###################################################################

# Created by write_sdc on Tue May 13 13:25:31 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_fanout 12 [current_design]
set_max_area 0
create_clock [get_ports wb_clk_i]  -name clk  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.01  [get_ports wb_clk_i]
set_input_delay -clock clk  0.01  [get_ports wb_rst_i]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[31]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[30]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[29]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[28]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[27]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[26]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[25]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[24]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[23]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[22]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[21]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[20]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[19]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[18]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[17]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[16]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[15]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[14]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[13]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[12]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {wb_dat_i[0]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_adr_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {wb_sel_i[0]}]
set_input_delay -clock clk  0.01  [get_ports wb_we_i]
set_input_delay -clock clk  0.01  [get_ports wb_cyc_i]
set_input_delay -clock clk  0.01  [get_ports wb_stb_i]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[31]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[30]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[29]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[28]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[27]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[26]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[25]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[24]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[23]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[22]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[21]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[20]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[19]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[18]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[17]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[16]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[15]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[14]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[13]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[12]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[11]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[10]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[9]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[8]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[7]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[6]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[5]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[4]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {m_wb_dat_i[0]}]
set_input_delay -clock clk  0.01  [get_ports m_wb_ack_i]
set_input_delay -clock clk  0.01  [get_ports m_wb_err_i]
set_input_delay -clock clk  0.01  [get_ports mtx_clk_pad_i]
set_input_delay -clock clk  0.01  [get_ports mrx_clk_pad_i]
set_input_delay -clock clk  0.01  [get_ports {mrxd_pad_i[3]}]
set_input_delay -clock clk  0.01  [get_ports {mrxd_pad_i[2]}]
set_input_delay -clock clk  0.01  [get_ports {mrxd_pad_i[1]}]
set_input_delay -clock clk  0.01  [get_ports {mrxd_pad_i[0]}]
set_input_delay -clock clk  0.01  [get_ports mrxdv_pad_i]
set_input_delay -clock clk  0.01  [get_ports mrxerr_pad_i]
set_input_delay -clock clk  0.01  [get_ports mcoll_pad_i]
set_input_delay -clock clk  0.01  [get_ports mcrs_pad_i]
set_input_delay -clock clk  0.01  [get_ports md_pad_i]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[31]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[30]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[29]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[28]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[27]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[26]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[25]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[24]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[23]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[22]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[21]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[20]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[19]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[18]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[17]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[16]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[15]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[14]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[13]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[12]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[11]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[10]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[9]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[8]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {wb_dat_o[0]}]
set_output_delay -clock clk  0.01  [get_ports wb_ack_o]
set_output_delay -clock clk  0.01  [get_ports wb_err_o]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[31]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[30]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[29]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[28]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[27]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[26]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[25]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[24]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[23]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[22]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[21]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[20]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[19]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[18]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[17]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[16]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[15]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[14]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[13]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[12]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[11]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[10]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[9]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[8]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_adr_o[0]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_sel_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_sel_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_sel_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_sel_o[0]}]
set_output_delay -clock clk  0.01  [get_ports m_wb_we_o]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[31]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[30]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[29]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[28]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[27]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[26]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[25]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[24]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[23]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[22]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[21]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[20]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[19]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[18]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[17]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[16]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[15]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[14]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[13]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[12]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[11]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[10]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[9]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[8]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[7]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[6]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[5]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[4]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {m_wb_dat_o[0]}]
set_output_delay -clock clk  0.01  [get_ports m_wb_cyc_o]
set_output_delay -clock clk  0.01  [get_ports m_wb_stb_o]
set_output_delay -clock clk  0.01  [get_ports {mtxd_pad_o[3]}]
set_output_delay -clock clk  0.01  [get_ports {mtxd_pad_o[2]}]
set_output_delay -clock clk  0.01  [get_ports {mtxd_pad_o[1]}]
set_output_delay -clock clk  0.01  [get_ports {mtxd_pad_o[0]}]
set_output_delay -clock clk  0.01  [get_ports mtxen_pad_o]
set_output_delay -clock clk  0.01  [get_ports mtxerr_pad_o]
set_output_delay -clock clk  0.01  [get_ports mdc_pad_o]
set_output_delay -clock clk  0.01  [get_ports md_pad_o]
set_output_delay -clock clk  0.01  [get_ports md_padoe_o]
set_output_delay -clock clk  0.01  [get_ports int_o]
